[["AITA Monthly Open Forum March 2023: Rule 11", "#Keep things civil. Rules still apply.   This month, we’re diving into all things rule 11. It’s one of our broadest rules, and often one of the most misunderstood.  Let’s start with the most common question - isn’t every post on this sub about some type of relationship? Yes, of course. One of the basic requirements of this sub is to post about interpersonal conflicts. And those typically don’t exist without some type of relationship (barring the random encounter with a stranger on the street, etc.).  What we look at is the nature of the relationship. When reviewing a post for rule 11, we ask ourselves if the conflict could exist outside the confines of a romantic relationship. Can this conflict exist between two friends, roommates, family members? If the answer is no, then it’s a rule 11 violation. A post about buying an engagement ring, considering a divorce/break-up, “catching feelings” for someone, romantic jealousy, dating, engaging in sexual acts, etc. are part of this rule. Choosing to not do any of the aforementioned also qualifies.   u/CutlassKitty gave a fantastic example in Januray’s Open Forum that sums this part of the rule up nicely:  > So \"AITA for telling my boyfriend to clean up after himself\" is allowed because it isn't about the relationship itself. But \"AITA for wanting affection from my partner\" isnt.  Borrowing from another user’s examples, u/stannenb gave this, also in January’s Open Forum: > I think pineapple on pizza is an abomination. I've told my spouse if they have to indulge in something demonic like that, do it outside the home. AITA? > I think pineapple on pizza is an abomination. I've told my spouse that if they indulge in something demonic like that, I'm going to leave them. AITA?  > The first conflict, about pineapple pizza within a relationship, is fine. > The second conflict is about ending the relationship because of pineapple pizza and would be removed.  However, rule 11 does not solely cover romantic relationships. It also covers cutting contact with/ghosting others. That includes family members and friends. Disclosing details of cheating also is covered and is often a reason for a post removal.   Reproductive autonomy decisions, such as having a child (or not), keeping the pregnancy (or not), and adoption also fall under rule 11. We have included situations about who to allow in a delivery room under this umbrella, as these conflicts regularly lead to breakups/divorce or involve threats for the same.   You might be asking “Why aren’t these topics allowed here?” There’s a couple answers to that question. One is that 99% of these questions are essentially about consent. We all recognize that anyone has the right to revoke consent at any time, whether that’s in direct relation to sex or just in terms of staying in contact with someone, or anything in between. This isn’t a matter that we can give moral judgement on; we simply cannot condone allowing a post where people tell someone they were wrong to exercise their right to consent. Another answer is that Reddit is a big place, and there are a ton of subs dedicated to relationships, etc. The answer there is simple - we have no interest in being another relationship sub. r/findareddit is a great resource if you’re not sure which sub is a good fit for your post.  ___  #As always, do not directly link to posts/comments or post uncensored screenshots here. Any comments with links will be removed.  ---  #[We're currently accepting new mod applications](https://forms.gle/M7i7hSF9iUUkHkqm9)  **We’re currently looking for mods with Typescript experience.**  We always need US overnight time mods. Currently, we could also benefit from mods active during peak \"bored at work\" hours, i.e. US morning to mid-afternoon.  * You need to be able to mostly mod from a PC. Mobile mood tools are improving and trickling in, but not quite there yet.  * You need to be at least 18.  * You have to be an active AITA participant with multiple comments in the past few months.  ---  We'd also like to highlight the regional spinoffs we have linked on the sidebar! If you have any suggestions or additions to this, please let us know in the comments."], ["AITA for leaving my sister in Europe after she disrespected the local customs?", "My (21m) sister (18f) and I had been planning this trip to France for years. We've both been saving up for years to get the money, and we went for winter break a few months ago. We were really exited to see all the sights, especially some of the older historical buildings.  At this really old church we wanted to go into, they explained my sister could not without changing because of the dress code. She'd have to cover her hair with this shawl thing they had, wear this wrap around skirt over her pants, and wear long sleeves. Well apparently she decided she was too good for that, and she rufused to go in at all. I was pissed.  I went back to the hotel, got the next ticket home, packed, and left without telling her. I texted her once before I got on the plane so she'd know where I was, but that was it. I'm not gonna go on a trip with someone who disrespects local cultures, and acts like every bad American stereotype.   Our parents reamed me when I got home, saying I was being terrible for leaving her for the last week of the trip alone (we'd only been there two days). But she's an adult, if she wants to be so disrespectful of other cultures, she can fly home alone. She hasn't spoken to me since she got home, which is fine since all I want is an apology."], ["AITA for acting crazy and spouting conspiracy theories to get my sister to stop including me in her videos.", "My (19 M) sister (21 F) is a \"social media chef\" on tiktok and youtube. I still live with my parents while going to college, while sis lives with some friends about a 10-minute drive away. Even though she does not live here, she comes over 2-3 times a week to film for hours in my parent's kitchen. She will make lunch and dinner for my parents and me, but she insists that she includes us in her videos. I'm not comfortable with this for a variety of reasons. One of these being her fans have made comments about me that I find highly inappropriate and I don't like.  I've asked my sister multiple times to please edit me out of her videos, or not film me at all. She's told me multiple times she would stop but still includes me in her videos and goes out of her way to still try and film me. my parents have also told her to stop, but they don't see any harm in what she's doing so they have taken a passive role in this.   A few months ago, a graphic designer friend of mine offered to make me some \"not safe for youtube\" shirt designs for me to order from her and I did. It gave me the idea to start acting a bit unhinged and inappropriate for the platform she's trying to make. Nothing of this is inappropriate, mind you. I'm not trying to offend. Most of what I'm doing is conspiracy theory shitposting. My parents even find it entertaining and my father has joined in as well as he also is a bit tired of being filmed.   Apparently earlier this week, I got my sister's accounts suspended. One of the shirts I got made has a picture of Ted Kaczynski with the word \"Hero\" under it, and when she was streaming Monday she turned the camera on me to ask me a question. I told her to stop and she continued.  While wearing the shirt I said \"Pay attention, people. Covid was created to hide the truth of 9/11.\" My sister got mad and shooed me away (despite coming to me and trying to film me) and just continued to be annoying in the kitchen. Last night she called my parents up mad because her streaming account got suspended because of me. She also got multiple videos of me wearing that same shirt flagged, putting her youtube account in jeopardy and preventing her from uploading to it for 14 days.   My parents just told her \"we told you so\" but I got into an argument with her on the phone. I fully believe she is in the wrong for filming me, but I learned that this might completely destroy what she's been building for 2 years now. Despite the filming me issue, I actually am now wondering if ruining her chance at this being her career makes me a giant asshole?"], ["AITA for refusing to help my daughter with her car payment because she is a stripper?", "I 47m have a 22 year old daughter. She’s in college and lives on campus. I agreed to help her make car payments, since she was in school.   I was recently informed by a young man I work with that my daughter strips at a club about 40 minutes away. I confronted her on this and she said she  didn’t plan to do it after she graduated, and she needed some money. I told her then work at McDonalds, not use her body.  We got into an argument, and i asked her to quit stripping and get a decent job then. She refused and said stripping was easy money, so basically I said there was no need for me to pay her car payment anymore since she is making money so easily. She got upset and said that wasn’t fair, and that she doesn’t make enough for that. I told her to figure it out.  She told my wife about what happened, and my wife is upset by her job of choice but says it’s unfair for me to stop supporting her so suddenly over an argument. I think it’s perfectly fair, it’s my money and my decision when to cut it off."], ["AITA for not eating dinner my girlfriend cooked?", "My (27F) girlfriend (29F) is a great home cook/baker. I eat everything she makes with zero complaints. Today she spent about seven hours cooking braised beef cheek while I worked for several hours.   I’ve never eaten beef cheek before, and she warned me it’d look a bit different compared to normal beef due to the muscles and all. When she started to pull it apart, it was grey on the inside and so off putting. I gave her a very disinterested face and was less than enthused and I can tell she was a bit hurt I wasn’t more excited about it. I tried some, It tasted exactly like meat you’d put in shepherds pie and I said she went through a lot of effort for little reward.   After that she got quiet and started eating a very small plate of the beef cheek and sides. I went back to working in the same room. By the time I looked up at her, she was packing up the dinner into leftover boxes and cleaning dishes. I got upset by her reaction and headed off to bed without eating.   20 minutes later she comes into the bedroom with a burger and some croquettes that she cooked for me but I told her I wasn’t hungry and was going to bed. When she heard that, she gave her dog my burger and has ignored me since.   AITA?"]]