[["TIFU By getting getting tested to donate a kidney to my wife.", "I decided to get tested to see if I could donate my kidney to my wife of 6 years. We have two kids together (4f,2m). My wife got sick just after our son was born and now is in need of a kidney transplant. We checked with her relatives and none were a match or a viable doner.  Last week i got tested. I knew it would be a long shot so I decided to get tested to see if I could donate. I got a call the other day saying that I was a match. The doctor then said something about wanting to do additional test due to some information from the HLA tissue test results. I didn't think much of it and agreed.  Then the results came in I was shocked and confused. He explained that because of how DNA information is passed down through generations a parent to a child could have at least a 50% match. Siblings could have a 0-100% match. And it was rare to have a high match as husband and wife. I asked what does that mean.  He said that my wife and I have an \"abnormally high match percentage.\"  Long story short were related. No I'm not kidding. I was put up for adoption before I was born. Placed into a family that moved across the country. I knew I was adopted but we didn't have any I formation about my bio family. It was a closed adoption.  I met my wife by chance 8 years ago. I was on a trip from work and she was working at the sight I went to. We worked together for a week. We exchanged numbers kept in touch. I was sent back there 3 more times that year and each time we became closer. I was given the opertunity to be transferred out there in a new higher paying position in a different department as hers the rest is history.  I don't know what do do moving forward but I know it may be wrong. She is my wife and the mother of our kids. This post is probably going to get removed but it is all true.  TL;DR: Wife of 6 years needs a kidney I got tested and we have an abnormally high match percentage for being husband and wife.  Edit: look at name. All of my family is from my adopted parents. My parents adopted me 2 minutes after I was born. Their name is on my Birth certificate. They have not told me anything about my bio parents and don't have any info. Her family is not a match as stated above most of her family has low match potential or can't donate due to medical or other reasons. I am 2 years older than my wife. I do know that my wife was born when her parents were late teens."]]