[["TIFU by not believing my bestfriends Suicide call for help", "Trigger Warning: suicide attempt, depression    Basically the title. My bestfriend has been going through a tough time for the past few years. He's depressed and has been diagnosed with bipolar disorder. He used to be employed but wasn't performing as well as he usually has because of his mental condition and lost his job.   I try reaching out to him but he doesn't answer calls and he usually just replies but only thru texts.   On Dec 24, he finally got back to me apologizing for not answering or replying to me lately.  He said he's been going through a lot of shit and that this time he doesn't know if he can handle it anymore. Me and my friend have a close but very sarcastic kind of friendship, so i just brushed it off.  Bestfriend said he was contemplating ending it all and that he wanted to just jump off a building. He mentioned a building in our city that was less 10 stories high, i made an insensitive remark telling him \"don't be stupid, that building isn't high enough, you'll just end up with broken bones, be in pain and alive.  Why don't choose a higher building?\"   This has always been the way we talk to each other for more than 10 years and this isn't the 1st time we talked about morbid stuff like this. That's how we cope with stuff and we always just laugh it off, we usually just try to one up each other with wittier remarks regardless of how dark or morbid our discussions are.   Instead of me calling to check on him, we just kept on messaging, continuing to be sarcastic to each other or so I thought. Even told him to go to my house and told him that we should just celebrate Christmas together, he declined.   His last message to me was \"i love you, man. Haha!\"  My last message to him was hold on and let's look forward to better things by next year.   A few hours after my message, i found out my bestfriend jumped off the building. Based on witness accounts i think he was already in the building when he started texting with me. I wish i had called him instead, maybe it could have ended differently.  It's not a total horrible story because he actually survived, he was rushed to the hospital and is relatively \"okay\" condition physically despite the fall.   Now, I'm distraught that i didn't do more. Now, knowing what happened to him i can't imagine what he's going through and i don't know what i can say or do when I'm able to talk to him again.  I'm so thankful that he's alive, but i know that what he's going thru will become 10, 100 times harder now. Also knowing that at anytime he could do it again.   This fucking sucks!  TL:DR My bestfriend reached out to me contemplating suicide, i laughed it off. Good thing he survived but now i don't know how to talk to him."], ["TIFU by accidentally identifying myself, my brand, and my company as \"Sh*t Head\"", "A couple of months ago, Whiles brainstorming various names for a brand i had planned to build, I came up with the placeholder name of CeannCac. This name was only supposed to be a word used for building a website - one to use in titles, product descriptions, etc,  and was to be changed later when I came up with an official brand. It was entirely a joke and was never to be seen or known by the general public. I was a self proclaimed ceanncac.  Those reading this who are Irish or from Ireland may recognize the translation of this word. \"Ceann Cac\" is in Irish, and translates directly to \"Sh*t Head\" in English. This is where my problem lies.  Due to issues with deadlines and finances, I never got around to changing this name. Still not seeing an issue with it at the time, i thought it would be interesting to see if this name would pass as i applied for sole proprietorship (for tax reasons) and registered the company name as CeannCac with the Irish government. Unfortunately, to my surprise, The name did infact pass.  Now, In every single letter that comes through my door, or any email I receive from the revenue commision, I get  called a Sh*t Head. In any business transactions i make, i get called a Sh*t Head.   (Un)Fortunately, I began selling quickly. This was an issue. Anybody who owns my products are actively showing off that they are self proclaimed sh*t heads. I had not foreseen any sales until at least February of 2023.   Making matters worse, In my quest to build my own brands product, rather than sourcing other ones, I contacted our manufacturer. I brought forward my plan for a branded bike we could sell, One which would sell on a limited basis. What I recieved in return was an E-Bike with the words SH*T-HEAD plastered all over the bike, along the sides, on any labels, on the handlebars and on the display, even on the saddle.   TLDR; Because of my own corner cutting in creating a brand name, I am now forced to accept my own new identity as a sh*t head, and I'm forced to push this name on other people. The financial costs of changing this are too much for me to currently cover."], ["TIFU by exploding Grandma’s glass shower door into a million pieces", "Alright, so this actually happened today, 4 hours ago.  I’ve been staying with my in-laws for the holidays and they’ve been such great hosts. Dinners, drinks, movies, games, the whole Christmas nine yards.  My wife’s grandma lives on the property in a little guest house and she’s able to come and go as she pleases while still having her own space. It’s great.  I’ve been trying to help with things and be of as much assistance as I can but there hasn’t been anything significant I can contribute, other than driving both of their daughters home for the holidays through 12 hours of traffic and snow storms.   So, onto the FU, grandma came over and let us know her shower door was jammed and fell fo the track, perfect opportunity. I’m the guy who can fix things, has tools, and the mechanical aptitude to work things. I jumped on the opportunity to fix the door and be the guy who saved grandma’s day.   I walked next door and the glass door won’t slide, jammed up pretty good. The rollers at the top of the door were out of the track and the door just needed to be lifted about a half inch to drop the rollers back into place.  I grab the door, go to lift and the whole thing explodes, literally explodes everywhere. Glass in my hair, shower full of tempered glass, and I’m barefoot standing in an inch of glass.   No idea what happened, no clue why it broke. I didn’t even get the glass door lifted off the door frame before it exploded.  The other grandma was on her way over so I ended up spending an hour in the bathroom, cleaning up the glass, cleaned the whole floor, picking glass out of every nook and cranny, out of my hair, out of my clothing, etc.   Unfortunately, the moment I was waiting for backfired spectacularly and now grandma can’t use her shower. My wife’s uncle is a contractor and he said it will be somewhere between $400-$1000, fuck.  TL;DR: been waiting for my opportunity to shine while staying at my in-laws for the holidays. Tried to fix grandma’s glass shower door and ended up exploding it into a million pieces instead.   Merry Christmas Grandma! You get a new shower door!"], ["TIFU having sex at my bf’s family’s house and ending up in the ER on Boxing Day", "I’ve been with my bf for nearly two years, only met his family once last Christmas as we live on the other side of the country. Pretty much, the night before Christmas eve, me and my partner had sex and at one point I felt his dick hit my cervix. Was momentarily painful but we changed position and continued and all was well. That was until ten minutes after we finished. I ended up with immense cramps and hardly able to sleep, but didn’t want to complain about it because I felt embarrassed about how it happened. Spent the whole of Christmas Eve cuddled up with a pillow nursing my sore stomach and by Christmas Day it felt slightly better. We spent the day at the beach and all was well, until that night. This is where I fucked up. I felt a lot better and decided to have sex again, like an idiot. It made the pain ten times worse and I ended up throwing up from the pain. Had to go to hospital that morning and have my insides poked at by the doctors to make sure my iud hadn’t gotten dislodged. Turns out, I’ve got a contusion in my cervix and am banned from sex for three weeks until it heals. His whole family now knows because his sister is a doctor and he had to ask her for advice before we went to the ER (they live out in the middle of nowhere so it was nearly an hour drive) and I ended up spewing in the car twice on the way there. I’m now nursing my damaged stomach and bruised ego while his family pretends to not know how I got so sick. My last week here is going to be so much fun.  TL;DR got punched in the cervix by bf’s huge dick twice in three days and ended up in the ER. Doctor sister told fam after being asked advice.   Edit: updated TL;DR"], ["TIFU by spending the night with an old friend", "Tl;dr at the end. Obligatory YIFU. I (26f) met a guy I’ll call Rob(26m) in our final year of college. We quickly became friends and spent some time together in classes and around campus. Nothing ever happened but I always thought he was attractive and funny, and our personalities gel like crazy. Anyway, college ended and we both went to universities across the country from one another. We had relationships, breakups, new jobs and independent adventures. We spoke a couple of times a month over text, and he eventually moved out of the country for work. Lockdown happened and while he was away our texting increased, and we speak a couple times a week and I always message him when I’m drinking/see something he would love etc. and he always messages me when he finds something I’d find funny, we send memes and stupid chat back and forth.  He came home to visit a couple of times in the past year and each time we met up and had a few drinks. The vibe was always immaculate with laughter and like… being physically near him felt like home. I’ve never told him that I think he’s attractive, and vice versa, but if I’m picking up cues like I think I am there’s a mutual liking for each other.   Anyway, onto the FU. On Christmas Eve we decided to hang out and do a pub crawl (traditional in England!). I picked him up as his parents live an hour away and because he’s just visiting doesn’t have a car. Immediately things go right back to where they always are with us. Kinda flirty, no awkwardness and just having a good time. Well the drinks are flowing and at one point he goes to the bathroom and another friend of mine who was out too said, “he seems so lovely, is this a date?”  And I was immediately on the defensive saying how we’re just old friends, that nothing would ever happen etc. However as the night went on we were getting closer and a part of my brain just said: yes - you do want to date this man, stupid.  The night was winding down but we’re both a bit pizzled and so I asked him how he’s going to get home. He said he would walk or get the bus (it’s 20 miles at 3am and there are no buses). He could have got an Uber, but the surge charge is ridiculous. I said he could stay at my place. We got a ride home and stayed up a little longer drinking and talking, and during this he’s holding my hand and we have moments of just silence and eye contact. I set up the sofa so we could crash there (family staying for Christmas meant otherwise sharing a room with a relative) and we slept together. Nothing happened but snuggles and spooning and forehead kisses but the way he was holding me felt so good and natural and like something I didn’t realise I always wanted. During the night I told him I’m so glad i met him and “even thought we don’t say this… know i love you right?” And he replied that he loves me so much. He gave me a big squeeze and pulled me closer to him but we just went back to sleep.   In the morning, my family came into the room and I made the introductions ; my family know of him from college and i do talk about him sometimes so it wasn’t actually too awkward! Anyway we were still so tired and, finally having access to an empty bedroom, we napped a little longer.   I felt like there were times that he wanted to kiss me, and there were long stretches where I wanted to roll over and just… do what came naturally.  By this point my family are being quite loud downstairs and I realise this can’t go on forever - it’s Christmas morning and I need to open presents and he needs to go back to his family. I convince him to get up, we have short but lovely conversation with my family and I drive him home.  We were both a little giddy with a hangover and excitement but we chatted and laughed the whole journey. We had a little hug as he got out of the car but immediately I started feeling like this is it - I’m not going to see him again for who knows how long as he’s going back abroad in a few days.   The reason I think I’ve fucked up is that I am in love with this man and I can’t tell him. I know myself and I wouldn’t be able to handle a long distance relationship, and I also would hate so much to lose my friendship with him by telling him if he doesn’t feel the same.I cried on my way home over thoughts of loss and how if I’d have realised how I feel sooner our lives could have been different. I’m saying this all not knowing how he feels, but in my heart I know he’s a person I want around forever.  I’m not posting this for advice, but needed a little catharsis!  Tl;dr: I realised I’m in love with my old friend and due to geography, timings and work, it’s a shit things to have realised 8 years too late."]]