[["UPDATE: r/storytime is now a public sub! Make sure to check out our brand new sister sub r/fictiontime", "That's right folks, after four long months I have finally been able to work on this sub. No longer will you need to be on an approved users list. Feel free to post all you want but make sure to keep our rules in mind. Also feel free to check out our brand new sister sub r/fictiontime a fun collaborative creative writing subreddit run by the mod team of r/storytime! Have fun sharing your stories with all you fellow story timers!"], ["My friend started vaping again and I don’t know what to do.", "My(14F) friend(14F) who we can call Alison started vaping last summer because of peer pressure and a few other reasons back in November she decided to quit vaping. I became friends with her in early December she had told me about her struggles with withdrawal and this caused depression & severe anxiety and even did SH to herself. I’ve been one of her friends helping her stay sober and she has been very thankful of that. Recently one of our mutual friends got a boyfriend and now thats all she cares about and has been ignoring Alison, Alison started thinking about SH again.(she didn’t do it, that I know of) but she did hit a vape & I’ve told her my feelings about this multiple times and that I don’t feel I am strong enough to be there while she’s going through this and going through withdrawals again because I don’t want to see her in that type of pain. However we have become very close over the past few months and I even consider her to be my best friend and now I don’t know what to do. Please help me. I can’t stop thinking about this."], ["Something is up around my house", "     So a rough lay out of mine and my husbands house- we live in a one story house the has a wooded area behind it. Our dining room leads out to the back porch and you can see the porch from the kitchen window and also my bedroom window.       So I’ve (24F) been working a lot lately. And because of my husbands (26M) job he’s not usually home. It’s usually just me and my dog. The past couple of months I’ve been hearing a shuffle noise out on my back porch. Whenever I turn to look out my window to look out the back porch everything goes silent. All I can hear is the humming from my ceiling fan, when I turn back to go to sleep it sounds like foot steps walking off of the porch. So recently I have been talking with some of my friends about getting a security camera. I ran it by my husband who says that “I am just being paranoid” and I “don’t need to go to such lengths.” Jokes on him I did it anyway and my cameras got here last week. I was really hesitant to put them up because I may have just been paranoid, but this morning I found to what looked like to be a smudged hand print on my bedroom window. They. Are. Going. Up. I’ll update this if anything happens."], ["My brother is mentally unstable , I’m afraid of him.", "To begin, me and my brother are very different. Even since little. Id be the smart straight A student, while on the other hand he would get suspended at least once every 2 months. To some extent we related a lot even tho we had no similarities. He was my best friend growing up.   Our dad did a few years in prison when we were younger & My grandma which he was very close to also passed. He was diagnosed with depression at around 7. There would be times when he’d come home late at night with stolen items up to 400$. He’d sneak in and out of the house. He was 13. Our relationship slowly started to crack and we drifted away from each other.   My mom had recently got out of a breakup in 2019 and decided it’ll be best to have a fresh start for our family in Florida.   So In October of 2019 we moved to Florida. It was pretty rough at the start, but my mom quickly got on her feet. My brother started causing problems so my mom figured it’ll be best to send him back to my dad for a few months. It was pretty lonely for me since my younger sister was with her dad in Arizona and my brother was at our home state.    Few months later he came back and everything only got worse. I cant remember much from the years 2020-2021. So skip to 2022. He was really aggressive and manipulative. He would punch holes in the walls and tear the house upside down. My mom was a single mom of 3 kids and it was alot on her. He then started stealing , and I don’t mean 20$ but he’d steal up to 300$ from my mom. Whenever he seen money he’d take it. What he wanted he’d take it.  It was so bad everyone in the house would hide their things in their own rooms. He’d fight with my mom all night and he’d cause problems with me and my sister. There was a time my mom gave me 20$ and he tried to forcefully take it. I always stood my ground and so I fought back. Remind you he was about 6’0 and I was 5’4. He found a way to grip me and he slammed my face on my bed frame and almost broke nose. He was very aggressive.  There was also a time my mom locked all the windows and doors while everyone went to school , he got so angry that he broke our front door knob. Another time he broke the window. It was several times I’d come home and my room was flipped upside down . I’m a artist and I have my art on my wall and my art was torn to pieces. I also put pictures of my family on the wall including him. He tore every picture down and ripped himself out of every one. He’d do this because I wouldn’t give him money.  There would be times where I’d ask him why he stole so much and his response was “if I don’t have it I’ll take it”. There was times he would randomly start yelling and crying like he’s on something when my mom “bothered” him  Anyways like I said before , he fought my mom all the time and on this specific day when he was fighting my mom they got physical. I was in the bathroom so I didn’t really witness it. That’s when I heard banging on the bathroom door he was screaming my name saying “call the police, I’m bleeding!”  He did this to make people feel scared or just to be dramatic. Anyways I quickly ran out to see his hand bleeding. I was confused and later figured out my mom threw a glass at his hand because of how physically he was getting.   They questioned me and my sister and cps came. My mom told them she didn’t want him back. So they sent him to a “shelter” for teens. It was more like a place for rebellious teens. He eventually got kicked out of there for not following the rules , so he came back home. I forgot to mention he was a heavy smoker and would often get in trouble for it. He skipped school daily and it was just getting worse and worse. My mom then sent him to my dad again.  We thought he’d change his life around but we were wrong. He started stealing from my dad, then my step mom. My dad had to live with my nana for some time and my brother went with him. He stole from nana and my aunts + cousins. It was getting to the point we’re no one wanted him around. His stealing even continued when my dad got a house with his girlfriend and kids.    A few months ago I visited my dad and my sisters for a month after 4 years. I haven’t seen my brother in almost 2. When I was there he’d always find ways to argue with me and was super Manipulative. He’d call me a bad sister and other names. We’d sometimes play fight but he always took things too far. He never seemed to really care about anyone but himself. I tried my best. He just didn’t want to cooperate with me unless it was his way.  I returned home and just a few weeks after I left he was back on his bs. My dad said he couldn’t handle him anymore and sent him to my aunt. He stole my aunt AirPods and sold them then ran away when she confronted him. He then returned to my dad. My mom constantly sends him 100s of dollars and is always giving in to him. Whatever he wants he gets. This past month he was suspended 3 times. He’s down to his last year of high but still acts rebellious.   I know theirs something mentally wrong with him , but my mom refuses to take him to a psychiatrist. I think right now rehab is the best option for him. If anyone can point out what could possibly be wrong with him please comment."], ["How a Pastor Stole a $25,000 00 Open Bank Cheque During Dinner in Member...", " [https://www.youtube.com/watch?v=bX\\_hW8\\_S5bk](https://www.youtube.com/watch?v=bX_hW8_S5bk)   How a Pastor Stole a $25,000.00 Open Bank Cheque During Dinner in Member's House   A Successful South African couple invited the Pastor of their Church for dinner in their home in California, United States of America.     After the Pastor left, the couple realized their cheque had disappeared. The man said to his wife; “I think the Pastor has stolen the $25,000.00 open bank check that I kept here on the table of which I had the intention to give to him”."]]