[["TIFU by telling my BFF about the time her husband got date rapey when we were kids.", "I was an 80s baby so what is now considered date rape, back in the early 2000s was just guys being guys and doing what they could to try and have sex with women (too drunk, too asleep to consent?… meh fair game back in the day).   Long story but my bff and her spouse have been fighting about a time when he literally tried to date rape her.  Someone fucked with her drink at a rave and she started feeling really bad and drugged, so they rounded up the friend group and everyone went back to his house and he promptly kicked everyone out so he could “take care of her”.  That’s when he tried to have sex with my basically unconscious friend. She remembers going in an out of consciousness and him trying but not much else. He tried to say that it never happened and that she just was remembering it wrong.  She remembers friends later asking questions because of how weird he was being.   I spoke with her today and realized that he was trying to gaslight her into believing she did remember it wrong. So I spoke up and revealed a time that he tried to do a similar thing to me (we’ve all been friends since we were 14 but were 16-18 at this point). We had all been tripping acid and when I was coming down and trying to go to bed, he decided that was his chance. I didn’t want to talk or be bothered so that’s when I pretended to be asleep and he got very touchy and down right creepy (to the point narrating what he was doing because he didn’t believe that I was sleeping) I had to get up and just leave the house because I wasn’t going to deal with that all night.  I figured it was just him being on drugs (and honestly this wasn’t the first or last time a dude tried to get touchy while I was sleeping), so I basically forgot about it. I had no idea that he had done this to her. I pretty much vowed never to talk about it because they were now dating,  it was the past and we all make mistakes and nothing happened because I left.  But then this happened and I let the cat out of the bag. Now I’m pretty sure I just blew up our friendship.  She won’t end her marriage I know that for sure but this might have just killed our friendship.  TLDR; friend was getting lied to about a time her husband tried to date rape her, she started doubting herself so I told her my similar experience with her husband and I’m pretty sure our friendship is over now. (She isn’t talking to me now so… probably)."]]