[["AITA Monthly Open Forum February 2023: Trolls", "#Keep things civil. Rules still apply.   This month, we’re going to touch upon something that we all encounter, not only in this sub, but across all of Reddit/the internet - trolls.  #**DON’T FEED THE TROLLS!**   Trolls crave attention above all else - and rarely do they care about what kind of attention they get. A troll’s goal is to get you to reply and engage with them, and the more passionate you get, the better. Any response you give to the troll, they will count as a win. Angrily insulting the troll is rewarding them. Calling the post fake is rewarding them. Explaining how you know the post is fake is not only rewarding them, but also teaching them how to not get caught next time. We understand the impulse to do these things, but when you do, you are doing exactly what the troll wants you to do.   Rather than give them what they crave, if you feel that someone is a troll, then act accordingly. Respond in such a way that *doesn’t* give the troll what they want. Do not engage, do not respond, do not reply. Simply report the post, forward any proof you have to modmail, and move on. Ignoring the troll is the best response you have to not feed them.    Comments that link their past posts or call out their “tells” can help the trolls figure out more ways to get their nonsense on the sub. When you suspect a troll, there are two fantastic options:  * Report the post for Shitposting/Rule 8! That will get the post in the queue, and we will review. * Send us any links/proof of the trolling to [Modmail](https://www.reddit.com/message/compose?to=/r/AmItheAsshole).  On a somewhat related note, we want to remind everyone that there are also some bad actors out there, trying to wreak havoc on Reddit. We’ve had some users say they received a PM from a Mod with instructions on how to get a post approved, or some other sub-related matter. Let us be very clear: While modmail goes through messages from r/AmiTheAsshole, we will never send PMs, chats, etc. from an individual mod. Anyone that sends a PM or chat claiming to be a Mod is lying to you, and you should not believe them. You *should* report them to the admins for impersonation. When you have a question, please message us via [Modmail](https://www.reddit.com/message/compose?to=/r/AmItheAsshole).  **We’ll see a return of the deep dives in to our rules next month, with a look at the “relationship rule” - rule #11!** ___  #As always, do not directly link to posts/comments or post uncensored screenshots here. Any comments with links will be removed.  ---  #[We're currently accepting new mod applications](https://forms.gle/M7i7hSF9iUUkHkqm9)  **We’re looking for mods with Typescript experience.**  We always need US overnight-time mods. Currently, we could also benefit from mods who can be active during peak \"bored at work\" hours, i.e. US morning to mid-afternoon.  * You need to be able to mostly mod from a PC. Mobile mood tools are improving and trickling in, but are not quite there yet.*  * You need to be at least 18.  * You have to be an active AITA participant with multiple comments in the past few months.  ---  We'd also like to highlight the regional spinoffs we have linked on the sidebar! If you have any suggestions or additions to this, please let us know in the comments."], ["WIBTA for not building a ramp to our house for disabled nephew?", "My wife and I recently bought a new house. After we closed on the house my sister came to see it and asked when we would like her husband to install a ramp. The ramp is for her son, who is in a wheelchair. He and other niece's and nephew used to come over to our old house all the time to hangout with our kids. My sister husband, who works in construction, previously installed a ramp in our old house as well as my brothers house because he and my sister want their son to feel welcome in everyone's' home.  Our previous house was very standard and installing a ramp was easy. This new house however sits up high which means it needs a very long ramp. After measuring according to specifications we've realized that we cannot install a ramp unless we get rid of some of our homes features.   Our front yard is a tiered garden. It is my wife's favorite feature as she is an avid gardener. We probably would not have bought this house if not for the garden as we had our eye on another. If we built a ramp leading to the front door it would cover the majority of the tiered garden.   The only other option is the side door (we do not have a back door). The side door however leads directly into the driveway that goes up alongside the house to the garage in the back. If we built a ramp in this area it would make the driveway too narrow for many of our vehicles. We have very limited parking on our street so we would basically lose half our driveway parking. I also wouldn't be able to get my old muscle car in the garage where I had planned on storing it.  I've explained this to my sister and she is unhappy about our reasonings. Especially the one for the front door. She says she gets the parking problem, but the garden is just a cosmetic thing and not worth making her son feel unwanted or like a second thought.  Other family is also unhappy because now our house is unusable for family parties since nephew won't be able to come. We do family parties on a rotating system between me and my brother since we're the only ones with big enough homes. I said we could do the family parties out in the back yard in the summer. It's big and has a lot of trees and a large canopy area where we can put some nice outside furniture and barbecue. The garage also has a bathroom that is accessible, so it shouldn't be a problem for nephew to come so long as everyone hangs out outside. They think it's unreasonable because it will be too hot to stay outside the whole time and people will need air conditioning. If they go inside to cool down nephew will feel left out. My brother also doesn't like that the burden is now on him to always host. Especially since he will always have to host for thanksgiving and Christmas which are the most hectic holidays."], ["AITA for telling someone they’re selfish for asking a 22 year old to become a child’s guardian?", "My (22F) boyfriend “Malcolm” (22M) has a half-sister, “Elena” (12F). They have the same dad and he’s not involved in their lives. Their moms became close friends and they were raised seeing one another. Malcolm’s mom moved abroad a couple of years ago.   Elena’s mom “Sandra” was diagnosed with cancer last year. She went through treatment but it’s been determined that there’s nothing they can do but make her comfortable. Sandra will pass sometime this year. She has no family. Malcolm has spent a lot of time helping care for Elena, driving her to school, making them meals, etc.   Recently, Malcolm sat me down. He said that Sandra asked to speak to him. She said she understood if the answer was no but asked for him to take on custody of Elena, sooner rather than later that way she could adjust to him being her guardian before she passes. Malcolm would move in with them. Sandra had a sizable life insurance policy and an account to help him care for Elena.  To my surprise, he agreed to all of this without consulting me. I pointed this out and he said we’ve only been together 6 months. I asked didn’t he feel too young for all this. He said sort of, but he’d do it for Elena. Without further discussion, he subleased his apartment and moved in with Sandra and Elena.   Saturday, I stopped by to pick up Malcolm for lunch. He hadn’t returned from work yet so I was waiting with Sandra. We were making small talk. She mentioned how grateful she was for Malcolm and that he was a sweet boy. I asked if he was really her only option. I mentioned his mom. Sandra said Elena is losing enough, she doesn’t want to force her to move abroad on top of everything. She also doesn’t feel right asking Malcolm’s mom to move back.   I said I found the whole thing a little selfish. Malcolm is only 22. He shouldn’t be tied down raising a child. Sandra got defensive and said she wished she didn’t have to ask him, plus he said yes. I asked what else was he supposed to say. Sandra told me I was upsetting her and asked me to leave.  Malcolm called me later, screaming at me. He said that I upset Sandra. I said I was trying to defend him and point out options she may not have thought of. Malcolm told me to butt out and to get on board with this or walk away. He hasn’t spoken to me since. I saw Elena at the mall on Sunday and she ignored me.  My mom told me I screwed up big time. AITA?"], ["AITA for refusing to watch my niece while my sister gave birth?", "I 17m have an older sister 24. She has a 2 year old daughter. My sister recently gave birth (it was early and unexpected) and our family went to the hospital, everyone except me. My sister and my mom just expected me to watch my niece. I don’t know anything about watching a kid. I don’t know how to change a diaper or what they can eat. I tried to refuse and leave (I also had plans that day) but my mom basically told me if I didn’t watch my niece I’d be grounded, and this was an emergency and that I was being selfish. I left anyways, and now I’m grounded and my sister won’t talk to me because my mom had to stay home with my niece. I don’t think I’m the AH, I don’t have any experience with kids and I already had plans that day. My mom was there for my nieces birth, so I don’t know why it’s so important she’s there for the second."], ["AITA for not getting more involved in my daughters college fund situation?", "     I have two children, a daughter Sam (17f), and a son(19m), and I have always made sure that their education is a top priority. My son is already off at school and doing very well, and Sam was accepted into her desired college school and program, my mom promised to pay for her entire education along time ago, including tuition and accommodation. Everyone was overjoyed with this.   However, after my divorce several years ago, Sam started to prioritize my ex-wife’s family during every season, Sam decided to visit her mom's side of the family instead of spending time with mine. We always told there’s a lot more people there and the food is so much better. Can’t argue with the fact that her extended family was there, but I don’t think an hour with grandparents is asking too much. This all upset my mother and strained their relationship. Two weeks ago, she called me to tell me that she would no longer be paying for Sam’s education. She felt that Sam had put her own family second and didn’t treat her like she mattered at all. I hate to say it, but I also can’t argue with that.   Since then, Sam has taken full view of what college is going to look like for her. She will likely need to rethink her dream school and major. On top of that the loans will be an anchor in her life. She asked me to help, and I certainly will when I can, but when her mother and I divorced, she got all the college accounts and used that to fund her house. This is old news, but I feel very relevant.   While I feel bad for my daughter, I do not feel responsible for my mother's actions. She made the choice to stop supporting Sam’s education, and I cannot force her to change her mind. I have spoken to my mother and tried to reason with her, but she is firm in her decision. I have also told Sam that she brought this on herself for treating her grandmother less than the rest of her family.   Sam is understandably upset and feels like she is being punished for wanting to spend time with her mom's side of the family. However, I believe that she is old enough to understand the consequences of her actions and make decisions for herself. As a parent, I have always taught my children to take responsibility for their choices, and I feel that this situation is no different.  So, Reddit, Am I The Asshole here? Should have I gotten more involved?"]]