[["Revenge on the Movie Producer", "Please allow me to note well in advance, this story is not mine. In fact, it's a rather popular story in a town I once lived in (Savannah Georgia), and centers around one homeowner who got royally annoyed with a movie producer.  There will be a note at the end about the fellow this story is about, for those interested.  Okay, so first and foremost, when movie producers are looking for places to set a movie that takes place in colonial, or even 1800's cities in the US, due to the sheer number of parks, wide roads, and period houses; they will often select Savannah Georgia.  They'll pull all the spanish moss out of the trees, or trim it back, pour dirt on the roads around the squares, and effectively back date that part of the city to fit most any place, even up to some having used the area as a setting for places like early Washington D.C., and even places in Britain, or France.   Typically, when producers do this, they will pay each home owner whose house is used as background flavor, a couple thousand dollars for the licensing to do so. That will be important later. Trust me.  They issue some rules, like no electric lights being visible, not coming out of any door that faces the street, and you have to move your automobiles away from the drive (if you have a drive).   Well, 1979, a producer came from Hollywood with the intention of using Savannah for that very purpose. Specifically, the producer was from one of the big three letter TV channels, and was working on making a \"made for TV movie\" talking about the events after the assassination of Lincoln, and the subsequent accusations of the doctor present at his death.  The production went to the city to seek permission, and then sent an announcement out to each of the homeowners telling them of the various days that the shoot was going to take place.  However, much to their downfall, they also noted that the production company would **not** be compensating the home owners for the use of their homes as backdrops.  This was met with some great annoyance by the homeowners, who turned to the city for help, only to be told that it was their 'civic duty' to allow the use of their homes.  Most everyone agreed to this, and bit their lips.  One homeowner, however, didn't. He decided to get revenge on the production, attempting to screw up their shooting every chance he got. He first started by leaving his car out in front of his house, only to have it towed before filming started. He threatened legal action against the studio, but that fell on deaf ears. He forbade the use of his home in some of the shots, but the production company got the city to make him back down.  Eventually, enough was enough.  So he waited, biding his time until he was certain they were filming.  When the day came that his house was being used as a background shot, the homeowner grabbed a massive Nazi flag and hung it out front of the house out of one of the top windows.  The production company balked. They knew that this ruined any shot they'd used there, and what's more they started to question just when he'd put the flag up. Was it just the one day, or had all the previous shots, some which showed the house from across the square, been ruined as well.  They turned to the city for help, and the city just basically shrugged saying that it was his first amendment right to do that... and implied that had the production company paid the homeowners, as had always been done before, then this probably wouldn't have happened.  In the end the production company had to end shooting, and go to the homeowner begging for him to remove the offending flag.  He did eventually do so, but only after his lawyer got a contract in writing that required the production company to pay all the homeowners for having their homes in the shot.  The flag came down, and shooting wrapped in less than a day.  Interestingly, it's said that in the movie in question (The Ordeal of Dr. Mudd) there are several shots where you can see a bright red nazi flag flying from one of the homes in the distance.  That stunt cost a producer quite a substantial amount of money, and pushed production back at least a year while they tried to find every single instance that the flag flew in the background shots.   This homeowner would go on to himself become very famous... though not for a good reason. Even so, he lives on among the legends of that city, both for his revenge against a movie producer, and his later brush with fame.  >!The fellow in question is none other than Jim Williams.  Williams was an American antiques dealer and a historic preservationist based in Savannah, Georgia. He played an active role in the preservation of the Savannah Historic District for over 35 years. Williams was arrested on May 2, 1981, for the alleged murder of 21-year-old Danny Hansford, with whom he had been having a homosexual relationship, at Mercer House. After the subsequent four trials, a record in the state of Georgia, Williams was finally acquitted by a jury in Augusta in May 1989, eight years after his arrest.  Williams died in 1990, of heart failure, though AIDS is also suspected.  He is the center of the story \"Midnight in the Garden of Good and Evil\" novel, and later Clint Eastwood movie. !<"]]