[["What does \"Personalized Off My Chest Style Post\" mean?", "People have been telling me that their posts I've been removing actually shouldn't be removed because they are \"personalized\" and meet the \"off my chest\" criterion.  I'm going to explain this is greater detail with plenty of examples so what type of posts are allowed is more clear for everyone to understand.  Personalized in this case means that what you're posting has to be directly related to you (this would include a close person, such as a family member).  And it can't be something that's impacting a large number of people unless it has a specific application to you.  **Examples of valid \"personal\" posts:**  \"I just found out I owe a bunch of money on my taxes!\"  \"My parents just found out they owe a bunch in back taxes and might go under!  I wish I could help them!\"   **Examples of \"impersonal\" posts:**  \"Taxation is theft!\"  \"Don't you hate it when you have to pay taxes?\"   **What is meant by being an \"off my chest\" style post?**  An off my chest style post is you getting something off your chest that's personal in nature (so, both related to you or someone you know quite personally and has a direct impact on you or them that isn't generalized) AND that is a story, situation, hope for the future, or some other type of direct situation.  **Note:  Opinions, hot takes, asking generalized questions not tied to a valid post, political commentary, talking about things that have nothing to do with you SPECIFICALLY, generalizations, etc. do NOT count as off my chest style posts.**   **Example of valid off my chest style posting:**  \"I stubbed my toe and cried today.  I feel so humiliated.\"  \"My friend is transitioning and it feels like they're becoming a different person, but I want to support them.  It just feels like I'm losing them.\"  \"I lost my job due to [insert cancel culture thing here].\"  \"My parents hit my kids and I don't want them to ever see or touch them again!\"   **Examples of invalid off my chest style posts:**  \"Stubbing toes is the worst thing ever.  Does anyone else agree?\"  \"Transitioning fundamentally alters a person to the point where they aren't even themselves anymore.\"  \"Cancel culture is bullshit!\"  \"Children should not be hit!\"  \"As an (insert group here), I feel that (insert opinion here).\"  \"I like X TV show.\"  \"Does anyone know how to fix a broken headlight?\" (we've gotten these before, lol)  \"Not ALL men/women...\"  \"[Insert any commentary on any hot-button topic here.]\"  **Note:  You can give your opinion on a personalized situation, but your whole post can't just be the opinion, and it has to be something that's meaningfully specific.  But you cannot stand on a soapbox and preach it.**   In some cases, a post may be removed that can be reworded to \"fit\", but the majority of the time there isn't a way to reword a post to \"fit\".  I am quite aware that this kills a large portion of what the sub used to allow, but after seeing the types of post that are now front-paging that simply weren't allowed to before due to all the flaming and getting the same hot takes over and over again, I honestly can't help but feel like this was a net positive.  Also, my removal of your post for not following the rules has nothing to do with whether or not I personally agree or disagree with the post.  I've removed something from every major category recently.  I'm also pretty good about explaining how posts don't fit the criteria if asked on any given specific.  This absolutely sucks for me.  I've removed over 500 posts in the last 4 days.  I hate this, but the benefit to the subreddit is substantial, so I'm going to keep this going as much as I can.  Also, if a post is up that violates these rules, 99/100 times it's because I'm sleeping.  I may also make a mistake or another mod might approve a post that was removed by the automod and not my manual flagging."], ["My older sister's boyfriend confessed his feelings to me.", "I (17f) have an older sister (21f) who I'll call B. B has a boyfriend (21m) who I'll call J.   Just like I said in the title, J has confessed that he has feelings for me and he said that he has had them for a long time. Just to clarify J and B have been together for almost a year and I've known J because my sister had a huge crush on him when they were in high school.   So I was really happy for her when she told me they were dating and since my sister still lives at home with our parents, J has been over a lot of times for dinner or just to hang out with my sister.   During our first meeting when B brought him home to meet the family, I didn't try to be overly friendly with him but I was nice to him. My sister told me later that he thought that I was a bit too cold to him and asked me to be nice to him so every other time I saw him, I was nice. I greeted him, talked with him about several topics which we had in common like anime which we were both very huge fans of and I thought he was really cool. But that was it. I had no interest in him romantically and just saw him as my sister's boyfriend.   But just yesterday during a Halloween party our family was having with our friends and family, J obviously came as my sister's date. I was having a lot of fun and I remember J coming up to me and asked if I could help him get drinks from the fridge that our family kept in the garage and I agreed. On the way there, we were talking about our costumes and how they matched as they were from the same anime. Before we returned to the house, he grabbed my hand and told me he had something to say.   He then confessed to me that he had a crush on me and that he was first hoping that his feelings for me would go with time but he felt like everyday he came to our house his feelings would grow. He also said that he can't stop thinking about me. I felt uncomfortable as he spoke and asked what about my sister and their relationship and he said that he loves my sister but loved me more than her and said that he was sorry for having feelings for me when I am still a minor and he is an adult and that he just felt like he had to let me know. I was quiet and so was he as he looked at me awaiting my answer.  I told him that I don't have feelings for him and I think that him confessing to me will ruin the friendly relationship between us and I told him that I'd tell my sister because I didn't want her to misunderstand. But he begged me not to tell my sister because he still wanted to date her and I told him that he can't date someone if he doesn't have feelings for them and ran back to my house to try and find my sister.   I found her and she immediately asked where J was. I pulled her aside while telling her that there was something she had to know and we went to the bathroom which was fairly quiet and I told her about what J had told me. She looked at me silently for a few seconds before going outside the bathroom. I followed her and saw her take J away by the hand as they went to her room upstairs. I couldn't focus on the party anymore and kept looking up to see if J would leave the house but he didn't leave. Even after the party was beginning to end, they were still up there. I thought maybe it had gone bad and that J had probably hurt my sister so I told my mom what happened and we both went to check on her.   We found them cuddling on her bed and immediately she saw me, she told me to get out of her room. I was confused and asked what I had done. She told me that she's always known that I was jealous of her relationship with J and that she couldn't believe I'd go as far as lying to about J confessing to me and said that J was an adult and I was a child and whatever obsession I had with J should end. Then she told my mom a whole other story that J had apparently told her.   Apparently J told my sister that we were talking about anime in the garage while getting more drinks and I began to confess about how I liked him from the moment I saw him and that he tried to reject me nicely but I ran off to B and \"told her a completely different story\" just to make J look bad. I tried to defend myself but for some reason my mother sided with B and dragged me out of B's room.   My mother then told my dad what B had told her and my father was confused at first but at least he listened to my side of the story but my mom didn't believe me. She even called my aunts who were there and began to tell them and they were all telling me how wrong I was for trying to break my sister's relationship apart. B also came down with J and escorted J out before coming back to tell me that I have always tried to get everything from her and she knew one day I'd try to steal her boyfriends and my mom and aunts shamed me for it. Only my dad believed me.  I have been upset about it and both my mom and sister are ignoring me. I also cried a lot to my dad telling him the story over and over hoping that he doesn't get lied to by my sister. I sent a text to J telling him that he was a horrible person and told him how I couldn't believe he lied to my family and he sent a screenshot to my sister and just a few minutes ago she's yelled at me for \"still trying to ruin her relationship\" and for \"being obsessed and jealous\" of her and I was crying. I just want to know what I should do to prove my innocence. It feels so horrible to be accused of such a thing. I'm not talking to anyone in my house and I've been locked in my room."]]