[["Scariest Story of 2021 Winners!", ""], ["November 2022 Voting Thread", ""], ["I Received A Strange Request On My Onlyfans...", "I got a DM from a client the other day.   “$$2k. Urgent. Pls respond” - AlCrowlee88  I clicked on the profile. Just a username I didn’t recognize. No picture, no details. And I couldn’t remember if I interacted with them before.   I don’t usually respond to random DMs, and I was busy getting ready for a livestream, but that amount of money got my attention. Worse comes to worst it’s another troll telling me I’m a useless whore. Yawn.   “What’s the request? Custom vid?” - Addie  The reply came immediately. Guess it was urgent.   “I want u to draw me something”  I stared at the message for a second.   “??? Ur joking”  “No I’m srs. Draw me a picture. $2k no joke”   Fucking lol.   I’d been a sex worker for five years. Honestly, I’ve gotten a lot over that period, but this was maybe the weirdest request I’d ever gotten. You think you’ve heard it all.    I got a notification. My scheduled stream was about to start.   I glanced down at my outfit. I was doing a “pirate-themed” stream today (don’t ask, reward for a long-time subscriber), so I was dressed like Nami from One Piece. In a very, um, revealing blue bikini stop, short shorts, and a pirate hat (my own flourish). The subscriber didn’t specify the pirate, but I’m a redhead right now and I have pretty big tits, so… Go figure. I could kill two birds with one stone and get some anime fans to tip me and pay me to cosplay again. Believe it or not, I’ve been requested sexy Gaara from Naruto.    But… I’m not gonna lie, this guy intrigued me. If nothing else other than for my own entertainment.  “I don’t rlly draw. I’m not an artist” - Addie  “U don’t need to be. I just want u to draw it”   “Ok I’ll bite. What am I drawing?”   “This”   He sent an image attachment. Ooh yay. Another dick pic.   “not opening that”   As if on cue, a chime. $50 was deposited into my account. With another message: “pls open it”.   Fine. My dick ratings cost $20 so I was already ahead of the curve. And if it was something worse? Well, let’s just say I’ve been sent the darkest parts of the internet. So what the hell. I opened it. And what I saw was very strange. Stranger than I even expected.  It was a scan of an image. It looked like it was taken from a very old library book that got beat to hell or something. The page itself was yellow and cracked. And on it, a symbol drawn in splattered black paint on a wall. A row of interlocking circles with a crude sketch of an eye, six times, along its circumference, contained within triangles. And there were words circling around the edges of the image, but it was in a language I didn’t recognize. Like the letters were from some alphabet I hadn’t heard of.  I’d never seen anything like it.   “wut is this?” - Addie  No answer. I waited. Stared at the image. And then my eyes glanced up at the message chain. At the promised two thousand dollars. Probably eight streaming sessions worth of work. And if this is his kink, who am I to judge?  “You just want me to draw this? Like on MS paint or something?” - Addie  “No. On your floor. chalk works best”   “This is a joke”   “NO” - Al  Another $50 into my account. This guy was a fucking trip. But he clearly wasn’t kidding.   “I don’t have chalk lol. I can run to the store”    “NO. need it now”   It never fails. When the mood strikes, the mood strikes. They gotta get off right away.   I rummaged through the desk next to my cam set-up. Pushed aside random shit, make-up, papers, my toys. I found a pencil.   I looked at the hardwood floor in my apartment. No way that was gonna work.   Then I remembered - and found my old purse on the floor in my closet. And inside it, a thick, black sharpie. I tested it on the floor. Bingo. I messaged him back.   “Does a marker work 4 u?”   Again, the reply was immediate.   “YES. As long as I can SEE IT. Draw BIG”   Calm down, my guy. Horniness does strange things to a man. Well, fine. It wouldn’t take me more than a minute.   “Ok. drawing now”   I pulled up the pic he sent me on my phone, ignoring my other pending messages. And the chimes from my scheduled live stream and loyal users asking where I was. They could wait. They might even like waiting. Besides, I kind of wanted to see where this went.    So I kneeled down on the floor next to my bed. Pulled aside the carpet. Put sharpie to hardwood. And began to draw.   It actually showed up pretty well.   Listen, I’m no Picasso, but I was pretty good in high school. I even did an art show with one of the teachers. It was a portrait of my mom (I made sure to take it before her third glass of rosé). I think dad still has it somewhere, if he even opened anything he had after she died. Really, my point is, I’m not so bad.   I surveyed my handiwork. It was a little shaky - circles aren’t easy, you know - but it was pretty accurate. I might even call it damned good. I’d say he picked the right cam girl.   I turned down the lights and took a photo of it with a flash. Sent it back to Al.   “How’s this?\"   No reply.   “???”   Still nothing.   Oh well. At least I made a hundo. And got a fun story out of it.   Then my phone buzzed:   Two. Thousand. Dollars.   “YESSSS YOU DID SO WELL I LVOE UOU ADDIE” - Al  Jesus fucking Christ.  I spent maybe two minutes drawing this ridiculous circle. And I made more money than I did in the last month of camming.   Also, as a side note, don't judge me. I have a few loyal clients, but I’m not in some top percentage or anything. I’m hot, I’ll admit it, but I’m not trying to be the queen of Onlyfans.   As shocked and happy as I was with that amount of money for that little work, I remembered to keep my cool. And maintain my persona.   “I’m glad u like it Al. Anything for u ;)”   I tried to stifle the vivid thought that this guy was jerking off to a circle I just drew in sharpie on my shitty apartment floor.   “Ur the best”   Great. Easiest money of my life.   Thinking we were done, I moved to start my livestream. But then he surprised me.   “Wanna make 5k tonite?” - Al  Wut.   But I kept my cool. Always keep your cool with guys like this.   “You mean $3k more?”   “No sry. I mean $5k more.”   Okay, fuck the livestream. This guy could pay my bills for life.   “Anything for you Al”   Okay, obviously I’m not gonna do anything for this rando, but the guy who gets off on drawings probably isn’t gonna ask me to cut off my nipples all of the sudden.   “YESYESYESSS. I just need u 2 say soemthing and video tape it”    I’m not gonna lie. This request was another curveball. And his frantic messaging style was a little weird. But I know how hard it is to type with one hand. Not to be crass. (Also fuck you. Don’t be a prude. You’re still reading this.)  “what do u want me to say daddy?”   Okay, it was a shot in the dark, but a pretty substantial portion of my clients like it. And I kind of like it too.   No reply. Crickets.   Shit. Maybe I fucked up. A bridge too far.   I cursed myself for not just playing it safe to get another $5k. I could have had $8,000 tonight.  But then. A message. I wrinkled my brow reading it. Because it looked like complete nonsense:    “Klg’mna isetheh plmentu Klg’mnerbix mgnaph” - Al  I tried reading it about 30 times. I still couldn’t wrap my head around it.   “ummmmm. did u have a stroke?”  “LOL. No. Addie u are so funny. Just say those words. Video 4 me”   This guy could not be fucking serious. I sat for a second. Chewed my fingernails.   I started thinking about this. Really thinking about it.   Something felt off. This was weird, right? Possibilities started running through my head.   This guy doesn’t know who I am, does he? Did he dox me?   Was this Tyler playing some kind of sick joke? I didn’t think he had the money for this, but there’s always complaining after the fact to try to get a refund. And fuck he could be spiteful. “Here’s Addison, my slutty ex. She’ll do anything for a dollar. I made her say fucking nonsense and draw shit on her floor while she dressed like a slutty pirate. Anybody else want a turn?”   I looked down at myself, what I was wearing, and at the themed lingerie I had for later in the stream.  And my mother’s words rang through me: “You can make as much money as you want. It doesn’t matter if you don’t respect yourself.”   I’d never seen anything like this. And I was buying into it hook, line, and sinker.  I felt like an idiot. And I suddenly felt tears forming at the corners of my eyes. Thankfully another message snapped me out of it.    “Pls! I need it. Promise I’m not messing with u” - Al   Almost like he heard my thoughts. And even better,  with the message, another $500 sent.   “Thts just 4 u. I’ll still give $5k more”   Okay. Eight thousand for a single night? Fucking count me in, Tyler and my mom be damned. I wiped my eyes, resolved myself to put on my big girl pants, and resumed this little game.    “alright I’ll do it! Calm down big boy. ;) Any tips for pronunciation? What language is it?”   No reply for a moment.   Then, not a message, but an audio clip.   Alright. At this point, with how much he’s spent, he’s earned me taking a listen. I put on my headphones. And then opened it.   There was just a crackling silence for a few seconds. Then, a strange guttural voice started. Raspy. Like James Earl Jones but after a thousand cigarettes. He spoke the words right into my ears. It was very intimate, almost sensual.   Al was not like I imagined him, if it even was Al. The recording felt old somehow. Very old. Like those recordings from when people used phonographs or whatever they’re called.   I felt chills shoot down my spine. Something about the recording felt very wrong. Instinctively I panicked. I ripped off my headphones and threw them on the ground without even realizing what I was doing.   I sat there for a moment.   My breathing was sharp. Rapid. My skin was tingling with goosebumps.   A chime nearly made me jump.   “U there? Did u listen?” - Al   I checked myself. Was I getting this worked up over an audio clip from some random guy?   This was his kink. No big deal. Sure, it was “unique”, and it made no sense to me, but I don’t make a habit of judging people. I wouldn’t have a job if I did.   I collected myself and replied. Back to fantasy Addie:   “Yes! I got it! I’ll say it and record now”   “Yes Addie ur the BEST.”   I took another stab with my message. Who knows? Maybe I could make even more off of him.   “Want me wearing anything? ;)”   “Wear whatever u want. Just say the words. And make sure u do it in front of the drawing”   That’s funny. I don’t usually get the cold shoulder, especially when I offer something like that.   But I shouldn’t be surprised. It just was an escalation of the first thing. I already knew he wasn’t like any of the usual clients - not so easy to please. In a way, it was refreshing he didn’t just want me for my body. Instead, I’d be making $5,000 for my art and acting skills, and that kind of gave me a little thrill.   So I set my phone up on my desk. Positioned the camera so it faced me. Kneeled down around the circle. And said the words as best I could.   “Klg’mna isetheh plmentu Klg’mnerbix mgnaph.” I said it slowly. Still butchering the words.There was no way this guy was gonna be happy - hope it wasn’t his first language or anything. If it was, he’d probably be offended. I stopped the video, preparing to try again.   Then a chime from my laptop. I glanced at the message.   “YES YESSS. keep saying. AGAIN”   Wait. I wasn’t live-streaming. And I hadn’t sent him anything yet. How did he know I was doing it? Did he just trust me that much?  My doubts were quelled when another chime announced five thousand dollars going into my account. So I did what anybody would do. I kept saying it. Over and over again. Recording the whole time.  And with it, more chimes. More messages. Tipping me to keep repeating this nonsense phrase.   It was all fair game. Until something started to feel strange.   A chill struck me. And a guttural, chittering hum, like from the audio clip, resonated through the air. Like other voices were speaking with me.   As I looked around the space, I no longer saw my centipede-infested New York apartment. I saw something else, like a hallucination, a desert mirage after a death-defying heatstroke.   And I felt that I was no longer  “me”.  I was… someone else. Someone in a far-away place, in a time that wasn’t now. Seeing things not meant for Addison.   I sat in a vast, oppressive city that stretched out interminably, row after row of towering industrial architecture jutting out at impossible angles. A skyline of crooked spires climbed high above where I could crane my neck to see, their throats coughing black smoke into a sky polluted with the putrescent color of sickly green.   And in that same sky, an innumerable collection of impossibly black, umbral stars. And they somehow felt… alive.   A wave of irrepressible horror shot through me. A sudden, icy realization of the existence of things I could not name. Could not understand. Their names, unutterable, except by a language already long dead when the planets were young and the sun was cold. But the mere existence of these beings somehow filled me with a sense of purpose. Of appreciation for what could come and what was to come and what had to come. What must come.   As I sat in that city where time had no place and God had no reign, whose name I numbly knew to be Klg’mnerbix , I felt the sable stars turn their malefic gaze straight towards me. I saw an engulfing green sky teeming with countless shadowy beings who knew me and knew my shame and fear and wanted me nonetheless, wanted me more for it. As if they saw me and straight through me and through my soul and every life I had lived in every past existence stretching through to the antediluvian eons of our feckless, aimless wandering.   But that wandering was now at an end.   Because I was myself. I was my ancestors. I was an ant, beholding the great works of mankind, my consciousness registering a thousandth, a ten-thousandth, a hundred-thousandth of their designs for an unaware, ungrateful universe.   The stars yawned. Bellowed. And the green sky turned black.   The world tilted. Turned in on itself. An endless city of onyx devouring itself and devouring itself and devouring itself and swallowing whole the children of ancient Methusaleh and greedy Belial and thirsting Klg’mna and these half-wrought children begging for their mercy and devouring themselves as well, for they were imitators of a god they would never know, never fathom, a purpureal abyss of eldritch origins awaiting them and us all, a womb, a warm wet engulfing swallowing hungry womb and -  BING!   My phone chimed.   I was back in my apartment. Sitting in front of my drawing.   My chin was coated with drool. Jesus. How long had I been out? And what had I just seen? Was it a dream? Almost like reading the words put me in some strange trance.  Last thing I could remember was the video. I looked at my phone.   It was almost dead. Because it had been recording for two hours. I stopped it. Scanned back through the video. It was just me, sitting in place. Repeating that phrase for Al.   For two fucking hours.   BING!   I glanced at my computer.   “You have done well.” - Al  He sure got my attention. Because the notification that came through told me something impossible.   Over the past two hours, Al had sent me $40,000.   I stared at my computer, awestruck. Did I just make nearly $50k for a drawing and mumbling some nonsense? I almost felt bad for the guy. But who knows - I could have been talking to Jeff Bezos, incognito.    Another message. This one made me stop. And made my mouth go dry.   “You have done what was asked. You have made this High Priest weep with quiet jubilation.”  The two hours that I passed out went through my mind again. Sending icy shivers through my whole body. But then I realized something. Tried to keep my cool. But I had to say it.   “What? Lol. I never sent you the video”   He didn’t reply for a moment. But when he did, I felt myself shudder.   “But there is still more to be done. Addison, you are one of the heralds for the Great Beckoning. In this life and the next. ”   What in the fuck is this guy talking about? He cums and is suddenly a completely different person. This was absolutely nuts. And more to be done? What else could he be asking of me?  But something about what he said struck something in me. Like a dream I couldn’t quite remember. A taste on the tip of my tongue. A city. Someone watching me from above me. Or…something? I had no idea.  “Wut are you talking about? You’re scaring me”   There was a long silence.   “Al?? What’s going on???”   Again I tried.   “AL TALK TO ME. ILL CALL THE COPS”   My breathing was ragged. Harsh. I was sweating. I felt terror gripping me. I was near to having a panic attack.   And then another message.   This time, it was a video attachment. With a trembling hand, I clicked it.   There he was.  Al. A kindly, seemingly harmless older man. Clean-shaven, a little heavyset, wearing what looked like a dark bathrobe. He was in a dark space. I couldn’t tell if it was a den or basement, but the walls almost looked like they were made of granite or stone or something. And I have to say, he scared me.   Because he didn’t say a word. He just smiled. A grin that contained a happiness that I was almost jealous of in that moment. Pure, endless glee, like a giddy child. He maintained that smile for a long time. Not moving a muscle. And I couldn’t look away.   He finally spoke. His voice was trembling with excitation.   “After a lifetime of service, my Rite is complete. I leave you now, hopeful that the world will soon be as it was dreamt of in Their ancient slumber. After countless millennia, dreams which were merely dreams… may beget reality. You must do this for others, Addison, as I have done for you. You must make them see the light… Draw the symbol. Invoke his name. One by one. One new acolyte for every moon that passes.”  Al leaned in close, his eyes suddenly glinting with a chilling malice.  “Do this. Or you may experience tortures beyond your wildest imagination. Tortures that will last a thousand lifetimes, tortures beyond your wildest nightmares. But if you listen, if you obey, your rewards will be everlasting… Remember, this is only the beginning.”  He smiled again. And then his smile faded. And became something more akin to orgasmic euphoria.   He lifted something into frame. A large, jagged knife. And never breaking his gaze, he did something shocking.   He pulled the blade across his throat. Slashing it open. As casually as if it was a friendly wave.   Blood poured out in streams. Spilling out all over him. Soaking his robe.   He shook with pleasure. In rapture as the warm flow of death overtook him.   The expression was familiar. I’d seen it on my clients’ faces countless times. Usually it was followed by the comedown. The acknowledgement of their shame as the orgasm faded and they prepared themselves to face boring, grim reality.   But his face…   It never lost that glow.   I couldn’t look away. Couldn’t shut off the video. As the man bled out. Unblinking. Until he slumped forward. The video continued for a few silent, agonizing moments.   Then it cut out.   I was shaking. Tears streaked down my face, mascara stinging my eyes. And my blood was as cold as ice.   I didn’t understand what had happened. Was I responsible for this man’s suicide? I thought it was a silly drawing, a funny phrase, a client with a kink that I hadn’t seen yet. But in reality, I knew in my heart I had been drawn into something more horrifying than I could ever imagine.   And his final words… They were a threat. A promise. If I didn’t do what he said, they’d come for me. I don’t know who and I don’t know why, but they needed their word spread. Their gospel. Once every moon, a new acolyte…   —--  All of that was a year ago. Since then, I pick one follower a month. Usually the most disrespectful or demanding. But sometimes, just the most gullible. And I make them take part in the same little ritual I did.    I’ve tried to avoid passing it on, sharing this strange curse, but when the moon reaches its fullest, and the cycle draws to a close, if I haven’t found my victim yet, I begin to see things. Hear things. I tried it once, just to see if Al’s threat was true.   It was.  It starts at the end of the first week, somewhere deep in the shadows. Little movements on the edges of them, like blurring the lines between our world and theirs, little tricks on the brain. By the second week, I begin to hear voices in the night. Urgent, furtive whispers. They begin as panicked chittering, but as the third week comes to pass, they grow angrier. More threatening.   By the fourth week, the shadows have eyes, and they watch me from the darkened corners and lonely spaces, willing me to do their bidding. Soon, they grow mouths. Desperate, hungry mouths that lick their lips as they wait for me to fulfill my bargain. They creep closer and closer to my bed as I sleep, eager to take their opportunity if I don’t. I can feel them.   One month, I waited until the night of the full moon, just as it was about to wane. I walked to the window. Pulled aside my curtains. Lifted the shades.   The sky was green. The stars were black.   And they were smiling at me. Their mouths full of row after row of jagged teeth. They promised me the endless torment Al had warned of. It had to be in my head…   I closed my curtains, went inside, and messaged a loyal follower. Within the hour, I had passed it on.   And just like that, everything went back to normal. No more creeping shadows. No more hushed whispers. When I opened my curtains, the moon gleamed back at me. And the stars kept their silent vigil as they always had – faintly visible over the city lights.   So I never made that mistake again. In fact, I never even wait past the first week.   Why am I telling you this? Other than for you to think of me as some insane girl who lost her mind after the stress of seeing a client do something so horrible. So traumatic.  Because if you’ve been reading this far, I can tell that you care. And I can tell that you probably understand that I live in constant fear, in constant terror from the madness and horror I desperately try to stave off. I barely eat. I barely sleep.   But the guilt is the worst part. Knowing that I’m passing it on just the same. Passing on the same thing I made my bargain for…  So I want to give you a warning, and ask you to please listen. If you get a profile like mine reaching out to you, asking you to do something strange, offering you something you very much want… Think twice.   It might be someone like me. And then you’ll see the shadows too.   - Addie."], ["Please Ignore The Whistles You Hear At 12:34 AM.", "Earlier this month, I moved into a new apartment due to not being able to afford my previous apartment, because inflation sucks. My new apartment is, like I said, completely new and it has an in-unit washer and dryer plus a dishwasher. It's a one-bedroom. *And* it only costs $800 per month. I mean, seriously, it can't get any better than this.  However, there is one slight, teeny tiny issue.  Ever since arriving here, every single night, I'm woken up by whistles at exactly 12:34 AM. By \"exactly,\" I mean on the dot. When I heard it, I wanted to go outside to see who it was, but decided against it because I *need* my beauty sleep. Can't have bags under these precious eyes, after all, right?  So, anyway. At first I assumed it was one of my neighbors. I went and knocked on their doors, and they all said it wasn't them. Their expressions did change when I asked, though. They got... more serious, almost? I'm not sure why. But they did say it wasn't them and they seemed serious about it, so I really don't think it's them. (Did I press my ear against my wall when the whistling started to be *absolutely* sure? Maybe I did.)  It was interfering with my precious sleep, so I opted for earplugs.  Then, to be 100% sure, I asked a friend of mine to come over. They slept soundly until 12:34 AM when they practically jumped out of bed and asked if I heard it.  I obviously said yes.  They wanted to go outside to investigate. I told them not to, had to physically pull them back into the one bedroom, locked the door, and told them to go back to sleep. They pouted and whined and groaned but finally fell asleep.  When I awoke, they were still asleep, thank goodness.  \"Hey,\" I stated, touching their shoulder gently and shaking them.  \"Hmm?\" they asked in a daze, before opening their eyes. \"Oh. Is it morning already?\"  \"Yeah. You should probably get breakfast or something. I'm going to be staying in today.\"  \"Can't I stay a little while longer?\"  \"Sorry, you can't,\" I said, disappointed. \"I have work.\"  They ended up leaving.  I ended up working a couple of hours and goofing off the rest of the hours. But then my mind went back to last night. It still weirded me out that my friend wanted so badly to go out and see who was whistling to the point where I had to wrestle them back.  I knocked on a neighbors door once more.  The old lady opened the door and waved. \"Hello. How're you? Still having trouble sleeping?\"  \"Hi. I'm doing well.\" I moved a hand to itch the back of my neck awkwardly. \"Sort of. I use earplugs now. I had a friend over last night and they wanted to check out whoever was whistling. It was weird.\"  A frown settled on her face, before she glanced quickly down both sides of the hall. She leaned in, her voice hushed. \"You need to ignore it.\" She swallowed hard, glancing around again. \"You need to ignore the whistling you hear. Do you understand?\"  \"I have been ignoring it,\" I confirmed. \"But why?\"  \"The more you listen to the whistling, the stronger the urge to go outside gets. If your willpower is weak like your friend's was, then it can only take one time of listening to the whistling to succumb.\"  \"But *why*? Why is going outside a bad thing?\"  \"That's how it gets you.\"  \"It?\"  \"Yes. It. If you go out, it'll replace you. It'll take you and take your skin. Look like you, talk like you... But it's not *you.* And if it gets inside your house once, it gets access for life. It can get you that way too.\" She licked her lips quickly, looking as if she wanted to say more, when another door opened.  \"Hey,\" a man in his late twenties greeted me, and I waved. He then directed his attention to the woman. \"Are you feeling okay, Ms. Tanner?\"  She swallowed hard, nodding a little. \"I feel just fine, Mark. Thank you. I think I'll go, actually. Don't want to hold you up,\" she says to me. She closed the door quickly.  Mark closed his too.  Weird.  But hey, $800 a month.  I went back into my apartment.  I searched high and low for my earplugs; they were nowhere to be found. I *know* I couldn't have somehow misplaced them.  12:34 AM, right on the dot.  Whistling right outside my apartment door.  It sounded like... like my friend.  But they didn't go outside because we both fell asleep.  Right?  The doorknob started to rattle as the whistling got louder.  I heard a soft *click.*  I'm hiding in my room. I locked the door. But this doorknob is rattling too and the whistling is low and frantic and I don't know what t  I am *so* sorry for writing all this. As stated, I've been pretty sleep deprived. My brain must be making things up as always. Again, I'm sorry for this weird, frantic rambling. I was incorrect about everything, as was the woman. Please know that it is 100% safe to listen to the whistles at 12:34 AM. Please know that it is 100% safe to go outside *and* to invite someone into your home at that time as well.  And if you live in my building, please feel free to stop by for a chat at exactly 12:34 in the morning. :)"], ["THE DEADLIEST GAME (PART 1)", "   It was late at night when I pulled up to the property, buried deep in a forest of skeleton-bare trees.  My headlights had been off for a while, and I quieted the engine’s rumble with a backwards twist of the key in the ignition.  Once the car was still, I breathed a sigh of relief.  No lights were turning on, no people were waking up inside the house.    My prey had not noticed me yet.    I opened the driver’s side door of my truck, keeping the decibels low as I closed it shut behind me again.  The cabin lights were rigged to stay dim, and I felt secure in the shadows by the gravel road.  There were no cars along this stretch, but still, I had pulled the truck far onto the grass, tucking it into the darkness of the trees.    I strapped two pistols to my waist and one on my ankle, slinging the lightweight assault rifle across my back for long range.  I wasn’t anticipating a fight, but it was always good to be prepared.    The sickle moon overhead provided a sparse glimmer of light as I stepped into the forest and began to move silently through the trees.  I’d done this so many times that my feet didn’t make a sound as I walked.    When you’ve been hunting the most dangerous game in the world for twenty years, you learn to be stealthy.    There’s nothing worse than being caught in the act when you’re trying to kill someone.    Making my way through the last section of forest, I considered the gunshot scars and old knife wounds which decorated my skin.  Wincing, I couldn’t help but remember the worst of them - a twenty-two millimeter to my side which had ping-ponged around my thoracic cavity, doing a multitude of damages.  I tried my best not to think about how much longer I would have to do this for.  How many more people I would have to kill before I could finally rest.  Before I could finally retire and be free of this madness.  But the people I work for will never allow that while I’m still healthy, and while I’m still in my prime.  I would need a lot of money to escape permanently, and to disappear completely from their grasp.       The lights up ahead broke me from my bad thoughts as I emerged from the forest and saw the target’s house was very close now.    Most times a man like this would own a dog, something big and terrifying, to scare away intruders.  A lot of my victims seemed to sense death coming for them long before it arrived, and they prepared for this by purchasing assault rifles and claymores, pistols and grenades, pitbulls and Doberman pinschers.  But my client had insisted this man was peaceful and innocent.    He was an elderly gentleman who lived alone, the anonymous voice on the phone had told me, insisting on sending the money by wire and never meeting face-to-face - paying an exorbitant surcharge for the privilege of anonymity.    The victim didn’t have any family.  He would be asleep in his bed by the time I arrived, and I would be in and out in ten minutes or less.    Easy money.  That was the client’s promise, and my own research had confirmed all of this as well.  After tailing the man for a week, I was confident he was at home, in his small house, sleeping quietly in his bed at this hour of the night.    I was about to pull out my lockpick kit when I decided to try the door knob instead.  Amazingly, it turned in my hand, letting out a small, rusted squeak.    The old bastard was just as trusting as they’d said.    Stepping inside the little house, I took my pistol from its holster and checked that the safety was off.  There was one in the chamber ready to fire at all times, and today was no exception.    Something felt off, though.  My instincts were telling me to run, for reasons I couldn’t understand.    The house was too quiet, too still.    I realized there was no noise coming from the refrigerator in the kitchen.  As if it had been unplugged.    But why would someone unplug their fridge?  The entire house was deathly silent.  Usually there would be a computer humming, a ceiling fan spinning, or a furnace blowing air through the vents.  But this place was quiet as a catacomb.    I told myself I was being foolish.  The old man was probably an eccentric who took out his fuses overnight, or maybe his power had been shut off by the city for non-payment.  Whatever the case was, I had a job to do.    Pressing forward, I went through the stale-smelling kitchen, past a dark entrance to the run-down living room on my right.  A stained couch and a ragged recliner could be seen inside, positioned in front of a television with bent rabbit ears on top.    Slowly pushing open the bedroom door, I stepped inside.    There was a shape on the bed which looked like a man, but wasn’t.  My keen eyes immediately saw that the normal rise and fall of the chest was absent - the man’s skin pale and plastic-looking.    It was a dummy, I realized too late.  The blank white face of it was expressionless and stared up at the ceiling as I gasped and my heart skipped a beat in my chest.    I’d been tricked.  This was a trap.   A hissing sound began to come from all around me, and I noticed a mist was coming through the vents now, smelling of chemicals.    My head began to spin as I crumpled to the floor, and the last thing I remembered was feeling as if the entire house were moving, like it had been picked up and placed on a tractor trailer, and was being driven towards the highway.    And then the world became a veil of total darkness for a while.  A heavy, black curtain made of velvet which rested over my eyes and told me to sleep.      \\*  I woke up on a beach, confused and nauseated, my head spinning viciously, causing me to vomit into the sand beside me.  After a while, I managed to focus on a single spot in the distance long enough to get my vision to settle, and eventually stood to my feet with an effort.      My eyes took in the surroundings with a sense of surreal fascination.    Palm trees.  Tropical birds.  Surf and sand with jagged rocky shards breaking through the whitecaps.    This had to be a dream.    The sun was blazing in the sky overhead and the ocean was glaring at me, a headache booming in my skull like an overinflated balloon about to burst.  Sand was clinging to my skin everywhere and I looked at it numbly.    How the hell did I get here?  But then I remembered the dummy in the bed and the gas coming from the vents.  The feeling of being driven towards the highway, like a pig in the back of a truck, headed for the slaughterhouse.    I’d been abducted.  But for what purpose?   I realized my feet were hurting terribly.  Worse than any pain I’d ever felt before in my life.    The sand beneath me wasn’t sand at all, but some sort of crushed glass.  My body had been numb from whatever drugs they’d fed me and I hadn’t noticed the stabbing pain in my soles until now.    Suddenly I felt the agony of it digging and cutting my skin, and saw my feet were bleeding and glittering with jagged pieces of it wedged into my flesh.    A sharp intake of air hissed out between my lips involuntarily - the closest sound I ever made to acknowledging pain - and I reached down to brush the glass from my feet.  It pierced into my fingers instead, slicing the pads with paper-fine cuts.    “What the hell is this place?” I asked no one in particular as I began to stumble from the beach towards the trees, off-balance from whatever I’d been gassed with.   As if to answer my question, an enormous semi-transparent dome appeared overhead, encompassing the island.  And then a face filled the sky, blocking out the clouds and the sun.  Like a deity, it was a thousand feet tall, and it took me a few moments to take it all in.    It was a man with gray hair and a friendly smile.  “Hello, and welcome to the island,” he said kindly.  “My apologies for taking you all from your busy schedules, but I’m quite sure you will be glad I did once I explain.  It is my great pleasure to inform you all that you have been chosen for a very special event.  Consider it the World Cup of Professional Killing.  I like to call it - The Deadliest Game.”  He paused for a few seconds as if he had made a joke and were waiting for me to laugh.  But then he scowled and continued.    “Each of you have been selected because of your particular skill set.  That skillset being murder.  There are twenty of you on this island.  I have looked into your backgrounds extensively and I understand you are the best of the best at what you do.  Killing people.”  This made me pause, as I realized suddenly that I was not alone.  This psychopath kidnapped a bunch of people and dropped us all on a private island.  I looked around, trying to spot another person, but could see no one.  It occurred to me suddenly that if I did spot someone, they might not be friendly.  Twenty MURDERERS were placed on this island, after all.  Not ordinary people.  The man had just said it himself.    I felt very exposed on the beach, and began to run towards cover.  There was a forest further inland, and I sprinted towards it, wincing at the pain in my feet with each step, driving the broken glass in further and further.  There was a sound of running water up ahead and I moved in that direction, thinking I could use the water to rinse out the glass in my feet.    “Jackson Triggs,” the man announced overhead, continuing his speech, and his face disappeared, showing another man’s profile picture.  “Navy Seal Squad Six Unit Commander.  Trained sniper and close quarters combat expert.  Survivalist and Iron Man competitor during his off-time.  My money is on you, Mr. Triggs, but some others are betting against the favorite, so be careful.  You never know when one of your rivals might receive a gift from one of their benefactors.”  You gotta be kidding me, I thought to myself.  What the hell is this now, The Fucking Hunger Games?  Benefactors?  Gifts?  Rivals?  Was Jennifer Lawrence going to pop out of the trees and shoot me with a bow and arrow?  The image in the sky changed again to reveal a woman with a stern, determined look on her face.  She was dressed in a military uniform that I recognized as belonging to the Green Berets.  The man’s voice began describing her training and battle history in terrifying detail and I realized I was in serious trouble.  These people were no joke, even if this whole thing felt like a bad YA novel.    One by one he described my fellow combatants until reaching my name at the end.  He described me with a few cursory sentences, making me feel small compared to my competition.    It struck me that I was the underdog, not the favorite.    “There is only one rule for all of you participating in my little game,” the man in the sky continued.  “The last person alive gets to leave.  They will also receive a handsome reward for their efforts.  Enough money so that you will never have to work again in your life.  One hundred million dollars.”  My legs froze mid-stride. I had been walking deeper into the jungle when I heard those words and stopped.    Was he serious?  A hundred million dollars?    People in my line of work kill for far less than that.   “Oh, and one last thing,” the man’s voice said from all around, like thunder booming in the sky.  “The perimeters of my playground will begin to shrink in exactly one hour.  By how much, you’ll have to wait and see.  The point is, you better not find yourself on the wrong side of the playground fence, or you’ll be punished quite severely.  That is to say you’ll be killed by drones with sidewinder missiles.  Ta ta!  Have fun, children!  And don’t be tardy!”  I started running.  Despite the fact that my shoes had been taken and I was walking on what felt like shards of broken glass, I had to move quickly.  Every time I stepped on a branch or a rock I felt a lightning bolt of pain shoot up through the bottom of my feet.  A few times I tried to stop in order to dig the glass out but was unable to alleviate the pain, and only injured myself further.    Finally I heard the sound of running water very close from up ahead, and realized it was a stream.  Approaching it carefully, I sat on a rock at the edge and washed my feet, arms, and legs, which were all covered with the glass-sand mixture.  The water turned pink and then red with my blood as I saw a million tiny cuts had been left behind by the jagged shards, the wound edges flapping in the water like fish gills as they were rinsed clean.    A small box with a red ribbon tied around it entered my field of vision.  It was floating lazily down the stream toward me, bobbing up and down as it bounced against rocks and tumbled down each little waterfall it came across.    When it got in front of me, I reached down and picked it up.  There was a tag hanging from the top of it which read:   Best Wishes,   Your Benefactor  I unwrapped the ribbon which was tied around the box and stuffed it into my pocket, to avoid leaving any tracks.  When I lifted the lid to look inside, I saw there were a few items.    A knife in a leather sheath, a canteen, a roll of gauze, and a pair of running shoes - thirteen wide.  Exactly my size.    Something caught my attention up on a tree to my left as I wrapped the gauze around the wounds on my soles, and put the shoes on my aching feet.    I realized it was a woodpecker.  But this wasn’t an ordinary woodpecker.  It wasn’t pecking any wood, for one thing.  Instead, it was just watching me carefully, keeping its head perfectly still.  Its one eye was trained on me and it looked slightly hollow and glassy, like a camera.  A whirring sound came from its neck as it craned its head to observe me.    They were watching me from all around.  Every angle was covered, like a reality TV show.  And I suddenly realized that was exactly what this was.  I was a contestant in a very expensive private game show run by the world’s richest psychopaths.  And I got the feeling this benefactor of mine wasn’t just helping me out of the kindness of his heart.    I recalled what the man in the sky had said, the words and their meaning delayed due to the adrenaline rush of everything happening.    My money is on you, Mr. Triggs, but some others are betting against the favorite, so be careful.    It dawned on me that considering the amount of prize money, this “game” we were involved in was likely a betting sport for a cadre of the world’s wealthiest elites.  I couldn’t prove it, of course, but it made sense.  Being involved with the sort of people I work with, I’d heard rumors of such events, but had always dismissed them as paranoid fantasies.    Now I knew it was true.    There really was a World Championship of Assassination.  And I was the underdog in the newest class of twenty contestants.    With that thought in mind, I put on the shoes, filled up the canteen with water, strapped the knife to my belt, and started moving.  Keeping my head low, I crossed the narrow creek bed and made my way deeper into the unknown forest, preparing myself mentally for the fight of my [life.](https://youtu.be/rumiJJyA2FM)     [JG](https://www.reddit.com/r/JGcreepypastas/comments/raq7ay/all_stories_20212022/?utm_medium=android_app&utm_source=share)   [TCC](https://www.reddit.com/r/TheCrypticCompendium?utm_medium=android_app&utm_source=share)"]]