[["UPDATE: r/storytime is now a public sub! Make sure to check out our brand new sister sub r/fictiontime", "That's right folks, after four long months I have finally been able to work on this sub. No longer will you need to be on an approved users list. Feel free to post all you want but make sure to keep our rules in mind. Also feel free to check out our brand new sister sub r/fictiontime a fun collaborative creative writing subreddit run by the mod team of r/storytime! Have fun sharing your stories with all you fellow story timers!"], ["My Neighbour Saw Me Naked", " I go to bed naked and usually get up and don’t put clothes on until after I’ve had my shower. This morning I forgot I had clothes in the washer. My washer and dryer is located in the basement. My basement has one window you can look out of close to the bottom of the stairs facing right next to our neighbours house. For context I live in a duplex/ cul-de-sac subdivision. The neighbours front porch overlooks the basement window. I was in my birthday suit walking down the stairs as I looked out the window. I could see a women standing at the front porch.  I’m sure she was looking directly at me. For some reason I awkwardly smiled at her but then remembered I’m not wearing anything. I’m pretty sure she saw everything but I ran down the stairs the last few steps as fast as I could after that. Not thinking of anything other than I just flashed my neighbour."], ["Astray", "  **AGES NAMES AND LOCATIONS ARE NOT TRUE TO CONSERVE THE PRIVACY OF EVERYONE MENTIONED**   I (21M) had met the love of my life (23F). She was was everything to me. My thoughts, heart and motivation. We spoke about constantly how we were going to run away together out of the shithole neighbourhood we lived in, to somewhere beyond hills and fields in North England. For the sake of this story I will be using the name Anna for the brother and Roman for the brother.   The first I met Anna, she moved into my neighbourhood when i was 11 with her mum and brother, Roman. Thier parents had got a divorce. I first made friends with Roman, from thier our friendship grew and grew and he felt like my brother. We would play football, cricket and neighbourhood wide watertight. But at the same time I was falling in love with Anna over the next few years.  For the next few year or so, her brother taught me how to fight, use a knife without being a goof and how to jack cars. Little did I know he was training me to be part of a Gang, I didn't realise this until it was too late.   The neighbourhood Gang wasn't your typical South Egnland Gang. They had ethos and self respect. Not like the Godfather type, still recruiting young kids, but treating them like family. Brothers. Their main business was Arms and Weapons, and then occasional weed sold locally. Non of us knew each others real names, except if we were invited by them and we all had self respect for one one another and ourselves.  After proving myself to the \"Brotherhood\" I was recruited to conduct thefts and \"Hit jobs\" on people who wronged us and posed a threat to our business. Roman and I were partners, we spent meny nights together. The odd car theft here and there, putting people in thier places, you know, the usual stuff.   At this time, Anna and I started dating without Roman's knowledge, and without Anna knowing I was working with his brother. It was a great year, and I wouldn't chnage a thing.  It wasn't until a year ago where we had found the location of a guy who stole from us. Roman and I went to the club that he was at and attempted to take him out as ordered. However, Roman's shots went stray and hit someone else.   We decided to lay low in a Hotel on the outskirts of our city. We destroyed the car and in the morning dumped the remaining burnt chassis in a lake, with our clothes, guns, knives, shoes and any other garments we had on from the night before.   Roman had to go home urgently in the morning to attend a family emergency, so I layer low in the hotel/town area for a few days, not making contact with anyone. That was the last time I saw Roman.  I missed Anna the entire week I was gone, and couldn't wait to get back to her. When I was told it was safe to return, I bought flowers, sweets and her favourite burger fir us to share. When I went to her house, no one was inside. I assume Roman had taken them somewhere for a few weeks, just to be safe. Days slowly turned into weeks, weeks turned into months and then eventually a year. I had risen in ranks in the \"Brotherhood\" and had a few teenagers working for me.   While driving home one day, I saw Roman's mother standing outside of thirr family home. I asked where Roman and Anna where. She instantly hugged me and said that that was from Anna and handed me a final note from Roman. I won't say the full contents of it but Roman said that the night of the hit at teh club, the girl we hit was Anna, and out of grief and distraught, he had killed himsel for killing her.  I still haven't found a brother like Roman, nor a lover like Anna, I don't know if I will.  I still love them both, and no one will replace them. I dream of Anna, and sometimes Roman, but not as much. Both of them will be a big part of me until I join them both."], ["one time we had a school party", "At this school party we could request a song. I went up and asked for Never Gonna give you up. They played it and I rickrolled everyone (even the principal) and I actually got a trophy with ,,Funniest person\". I became a legend at school"], ["So that's why the food was expensive", " I was hanging out with my friends a few days after New Year's, and we decided to grab dinner at a restaurant in a mall near our subdivision. We headed out around 7 pm and joked around during the usual traffic on the way there. When we arrived, we took our time deciding on what to order, and I couldn't help but think that the prices were a bit steep for the amount of food we were getting. Once we had all made our choices, the waiter told us that it would take 30 minutes for our food to be prepared. We nodded and smiled, then started reminiscing about our high school days.  Finally, our food arrived, and as we started eating, I heard some commotion from the table behind us. Before I could even turn around to see what was going on, I got hit in the back by someone's elbow. Two guys were in the middle of a heated argument - it turned out that one of them had opened the bathroom door too hard in front of the other and it had set him off. Mall guards stormed in as the two men yelled and tried to charge at each other. The angry guy's wife was pleading with him to stop, reminding him about their triplets.  I was pretty pissed off about getting hit by the guy's elbow, and I was contemplating whether or not to take a swing at him. However, one of my friends tapped my leg and shook his head, telling me to hold back. Eventually, the two guys were detained outside the restaurant, and we paid for our meal. As we were walking out, I passed by the angry guy and, still fuming, spat on his shoes and just looked at him.  We all walked back to the car, laughing and saying things like \"So that's why the food was so expensive - I wasn't expecting a pay-per-view event!\" It definitely wasn't the dinner we had planned, but it was definitely a memorable one."], ["The story of my downfall", "This is my story of the first ever relationship I had. It completely changed my perspective of life in a negative way, but on the good side, I've earned a lot of experience. Hope you enjoy. I sacrificed a lot for this girl (friends, family relations and my own sanity). **It shows how dangerous an obsessive relationship can really be.**  We met in *November of 2021* on Discord. Stuff between us went very good and we became best friends in a matter of weeks. We'd spend everyday together, got really close and actually started to grow a relationship. My family didn't really like that though. They'd always look down on the fact that I had a relationship. I often visited them, so to keep them atleast a bit happy, I wouldn't stop visiting them.  **My girlfriend, throughout the whole relationship, didn't like me leaving her alone. Since it was a long-distance relationship, that was often a hassle.** Especially my mother caused trouble. We were young (both 15) and we'd spend every night together, going to bed very late all the time. My mother sometimes forbade me to use my phone at night, whether that was by taking it from me or restricting me.  I had no way to let my girlfriend notice that I wouldn't be there at night. That left me stressed out the entire night, resulting in little to no sleep. My girlfriend would be stressed as hell, understandably. I'd have to explain the whole situation to her all the time. She didn't understand. **That didn't affect my love for her**, though. I loved her more than ever. It was clear she loved me very much aswell. We continued talking everyday, everywhere.  My friends abandoned me because of that. We had a massive fight on Discord, me and my girlfriend against ALL of my friends. Later it was revealed that **my friend just wanted to spend more time with me.** I, having my priorities, declined that offer. That's basically how it started.  Then, the beginning of the end started. Because of the constant fights I had with my mom, I decided to move to my father *(4th of April 2022)*, in the hope that he'd show more empathy for me and my girlfriend. **That seemed to be the opposite.** He was \"even worse\", with more restrictions than my mother. **I was left with two hours reserved for talking to my girlfriend per day**. At this point of my relationship, all I wanted to do in my life was talk to her, so I obviously made full use of those two hours. I found a way to use my phone more than two hours per day. My girlfriend was happy with that, but I think you'd figure that my father wasn't, when he found out. I now had to find every small moment of free time to use for talking to my partner. **We were both stressed out because of the little time we had together. It turned into a very toxic relationship really quickly.**  My grades dropped like hell. I didn't study at all. Previous year I failed aswell. The year I was in went very well, until all the trouble with my girlfriend. **I was blinded by love and didn't realise that everything went wrong.** Grades dropped and my girlfriend wasn't happy and blamed everything on me, despite talking to her every minute of my time. I was brought down, humiliated and made fun of by her. There just wasn't enough time spent to maintain a healthy relationship. One night *(29th of May 2022)*, before I moved to my father (relationship was already not healthy anymore), my self-loathing feelings got to me. I stole a razor blade the day before, and **I used it to harm myself with it, on my arm. It felt refreshing.** Maybe even holy. I found it funny how all the blood was flowing down my arm. I think that says enough..  It's clear that I've lost my mind. Still, I was attached to her all the time. Doesn't matter when, all I was thinking of was her. And she didn't lose her mind, she didn't harm herself with a razor blade or anything. That's partly because she wasn't getting blamed by her partner all the time, and she still had friends and good family relations. **Every day I spent turned into an empty pit of sadness, anxiety and guilt.** I lost the point of life. It was only silent up in my head. I completely lost it. I still thought it was okay, obviously blinded by love.  Then, disaster struck. My father forbade me to talk to her *(6th of May, 2022)*. This was the first time that I experienced such sadness in my life. It was horrifying. Time went so slow, my vision turned grey and nothing was enjoyable anymore. Why would it be? I just lost someone I loved all the way to the end, without receiving any love back. I decided to hide my feelings. **I was too ashamed to talk to anyone about it.**  Up to this day, **I've still lost myself.** I want myself back. I want joy, not fear. I still think it's my fault, the real me would've said something different. I wish I never met her. I wish I wouldn't be so stubborn to follow her blindly. I wish I would've listened to my family. I feel so stupid, they were right all along. It's so understandable now that I look at it. They've lost contact with me. My mother and father lost contact with their son. My friends lost contact with their friend.  That concludes my story, summarized. I hope you have a great day."], ["bored so telling story first post", "when i was younger i was at this place cant really remember and there was a body of water but to get to it you had to go down the very slippery ramp so 6ish year old me though hmm i want to go in and slop and chip my tooth im crying and my auntie swoops in to save the day and by rescuing me she dropped her phone into the water and had to get a new one moral of the story dont be really stupid like me :)"], ["The weirdest thing just happened..", "So I was walking behind a little girl (she looked about 10-12) and she was walking her dog. The dog then decided to take a dookie on side of the path and I heard her say  “No, Spooky. Lets find another way to torture the mortals.”  Im a atheist, and even I consider that unholy.."], ["My life is miserable mess. 1- my dad", "The story of my life is similar to one of the stories of the npcs characters from the game Genshin Impact, it always miserable, when I go back to my memory tape from the beginning, I only remember get insulted and hurt by my father, there's alot of my dad and none of them was even happy except one just one thing , when i was a little kid before any of my siblings was born my dad used to put me on his shoulders and run around that was really nice i really hate it that i miss him whenever i remember this memory it's really painful, anyway the rest of my memories with him was just so bad i will only tell you one, when I was almost 11 years old, sitting watching TV until I heard the sound of my siblings fighting over something. I went to silence them, but it was useless. I hit my younger brother, and he was very young, almost 5 years.  He cried and then slept, then my dad came home , he noticed my brother sleeping, he asked me about what happened, and I told him everything. I never expected what was going to happen after that. My mother was not in the house. She left us and went to her family for a while. Whatever, what happened after that, my father asked me to bring a log from the side of the wall of the house.  I don't know what was in my head at the time, maybe I was hoping that when he saw the log that was so big, he would let it go and hit me with his hand, but what happened was that he grabbed the log and hit it hard on my head.  My soul was gone for a second and when my feelings came back to me, I didn't know if I should be afraid, or keep quiet, or go, but I quickly got up and hid in my room and put a pillow on my head. The pillow was filled with my own blood. Now that I'm writing this, I realize how unnatural what happened to me, I was just a kid I didn't deserve it. Dad then looked at me coldly and went to watch TV.  I, after many years, realized that my father never saw me as his son, he did not even see me as a human being, he never treated me humanely, I was an animal to him. I hate my childhood"], ["Story time!", "Okay so this is really embarrassing. The thing is alcohol doesn't get me high no matter how much I drink but yesterday I got drunk(suprise suprise) and drunk called my crush and I told him that I liked him and cursed at him. I didn't want to drink in the first place but the bad events that happened on the day really hurt me so I thought I needed the drink. I'm so embarrassed and I even apologized to him but I don't think I can show him my face ever."], ["Just realized I learned a weird trick? kinda?", "Ok so today I was walking around with with my friends at the mall and we decided to split up real quick to get different things. After a while I was walking to the store she was in and I had thought that she had seen me so I was just following her around while she was looking at clothes and sht while I was on my phone playing survivor.oi (my currents addiction). Then suddenly she get scared and is all “wtf when did you come back I didn’t even hear you, why do you walk so quietly”. (See for context I’m 6’4 around 250lbs) kinda hard to not really notice, so either she was engrossed in her shopping and she has no situational awareness or Im some kinda of a ninja, and I feel like it’s more so the rather cause idr exactly when this started but i remember watching some directors cut typa thing when i was really young and it talk about how the elf actors in Lord Of The Rings would walk toe to hell instead of heel to toe. Me being a nerdy kid would walk around everywhere like that (essentially like a tip tie kinda thing) thinking i was all elf stealth ninja like and I kinda realized that i still walk toe to heel like subconsciously."], ["Crohn’s diagnosis (TMI)", " I (25F) was diagnosed with Crohn's disease almost 5 years ago. I started losing a lot of weight without even trying to. I was feeling sick a lot. I was nauseated and *TMI WARNING* had chronic diarrhea. I thought it was a medication I was taking because I take medicine for mental health issues as well. But then one day after the 4th of July, I was going home from spending the holiday weekend with a family friend and I felt sick the next day. I was supposed to spend that day after with my sister in law and her family, but I felt too sick to go. That next morning my sister was going to Atlantic City, but she told my mother to take me to the emergency room. I was in the ER for about 7 hours before my admission to the hospital. Within those hours, my mom demanded a CT scan. They got a scan and to my surprise they decided to admit me after that. I had a pretty bad anxiety attack. I was crying and hyperventilating. My mind was everywhere, my heart raced, I was shaken up. It was bad. That hospital stay solidified how much I actually hate hospitals lol. The getting waken up for vitals constantly throughout the day and night. being in the same four dull walls for as long as they need to keep you…having blood taken…needles…everything. I had to be on clear liquids for 3 days and prepped for scopes to be done. The prep was very awful. I had to have clear liquids as I have mentioned before. I had to drink Gatorade with mixed miralax…not fun! The next morning I went to get my endoscopy and colonoscopy done. I was very anxious! I got into the room and they did the procedure. It felt pretty quick honestly. When I woke up, my throat was very sore because of all the tubes stuck down my throat. It was awful! My sister had came back in town that day and came straight to the hospital to be with me. The next day, my sister in law came to see me. The staff had me walking around a bit more and I didn't really mind it at all. We were just chatting. The next day, I was out of the hospital. Before they let me go, I got the diagnosis of Crohn's disease. I was relieved, but scared. I was relieved because I finally knew what was wrong with me, but scared because I didn't know what that meant for me. Days after I was released from the hospital, I was back in the emergency room because of my arm hurting. I panicked bad. Turned I out it was superficial thrombophlebitis from the IV. When I got home that night. I was relieved to be going back home that night because I didn't want to stay in that hospital again. A couple of months later, my family and I had taken a vacation to Aruba. We were there for a week because my sister's birthday was around that time. Half of the time, I was sick or exhausted. Two days after my family and I came back, I started treatments for it. The treatment is an IV infusion. I have it every 2 months. It leaves me more exhausted than I've ever felt. Literally, those days, I sleep almost half the day away if not that But with my condition, I have embraced it as a part of my life. I just think of it as something that I am grateful for because it made me learn more about myself and made me learn to get through all my issues that I deal with. It has connected me with people who are going through a similar thing. It has also made me able to educate others on it."], ["I finally left my manipulating boyfriend/fiance to Burn in his hell", "English is not my 1st language and it's my first time postong, so i apologise for my misspeling. It's a little long story but hear me out please.  I (22f) and my (24m) now ex-boyfriend Has been together for almost a year. We both work at tattoo Field (this is important later) and we made nice amount od money. We were inseperable for whole time. We met at dating app. From the start he asked me to live with him after 3 days of seeing each other, which is a start od noticing his Red flags. He is from another city so i was really excited to show him my hometown were we met. I'm shy introvert and he's typical clubbing extrovert. We had nothing in common expect tattoos. At first I was really grateful for him that he was more than willing to help me gain more experience and bring me customers but slowly i realised that i was miserable this whole time. He was taking whole money i made so he can go drinking almost dayli, while i stayed at home cleaning, taking care od dogs (we had 4 of them), doing household chores, preparing tattoo designes, cooking and buying groceries. It was like holiday for me when he finally was tattooing client. I spoke to him about this and he strait up say that he only feels secure when he Has the money and his hand is really hurting him so he can't make many tattoos. Our sex life was also awful because he was the only person who was enjoying it and never listen to my requests. I couldn't complain 'cause he brought clients, I gained experience and was away from my family who was toxic at that time (but it's another story). His acoholism never stopped and his excuse was simply stess - he was going thru a divorce with his (i guess) 34y/o wife who Has full custody of his 4-5y/o son. I was so stupid to actually believe him that he can't minimaze his alcohol problems. I was really really broke and my family was a bunch of a holes so i guess that's why i stayed with him and simply ignored his Red flags. He then proposed to me while being drunk without a ring because as he later sayed \"i'm not worthy enought for one\". Next thing that broke me was that he forbade me from contacting my 2 best friends and told me that they try to sabotage this relationship and are not trustworthy because they are only for me when they want something. After some months he wasn't willing to bring anymore clients so i was looking everywhere to find any job so we can have any money to survive. He on the other hand was playing day and night video games and was forcing me to watch his Play. And one time we were so broke that the only money we had was my savings that he spend in the closest gas station on beers. Really bad thing happend while i was working at night and I developed serious PTSD and couldn't work anymore. We were then forced to stay with my mom. He was saying on dayli basis that my mother want's to manipulate me intro being unemployed daughter who's taking care of house and is private punching bag. My mother after seeing one post on Facebook where one girl is acusing us of fraud, she kicked my ex bf from home. He then after he return to his hometown was sorry for me, was trying to made up for me and promised change. I found It as a great opportunity to officially break up. When i arrived at his home i spoke to his mother and she sayed that he really changed. He promised me work in Field i'm interested in or simply work at his friend tattoo shop. I wanted that, i was unemployed for months already so i was seriously depressed at that point. This whole time he manipulate me into finding any job that isn't what he promised and still doing all the house chores around (i was yelled at because his mother expected me to do more and take care of my ex). Breaking point of this story had place at 6AM 2 weeks ago. Six Police officers came knocking and arrested my ex as i later discovered was because he had 2 cases of fraud in 2 diffrent cities. The last straw for me was 3 days ago when my mother called me and told me about another case when he with his mother got sued for manipulating my ex's ex-gf into staying with him and being locked and threted to kill her. So i waited for him to go to his (finally) job were we were supposed to work together, packed my things, grabbed my dog, left him a note and went to the closest train station. It was yesterday. I blocked him and his family on everything. I was so dumb and scared to do anything sooner. I don't know when he found out and what he did after but i'm reliefd. I'm broke and depressed but finally i'm free and not manipulated anymore. Now he will be facing around 5 cases in the court and surely he will be in jail. i'm more than happy about that. It's really scary how manipulative people can be. Please, maybe my case open someone's eyes and they won't ignore Red flags anymore. Edit: After developing PTSD i saw psychologyst and was on therapy, so unfortunatly using Word \"depression\" is not a metaphor."], ["I might be gay", "So this story took place a few months ago I am the captain of the rugby team so we travel alot to play against other teams so while at an opposing school me and my team were fuckin around mind u the school bathroom is like a few steps away from us i was looking away when one of my teammates pat my shoulder and tell me \"yo did u see that guy wearing a skirt\"  me \"no no I did not\" my friend then went on to tell me a about this dude me not paying attention and looking for this supposed skirt wearing guy when this dude walked out the bathroom wearing the opposing teams school uniform and gyatt damm bro looked absolutely stunning"], ["My classmate got caught in the boys washroom", "So be me (14M) at the boys washroom. There are 3 REALLY gay boys that constantly flirt and harass other classmates. So i was washing my... Uh... Private parts. (Important to the story) and they noticed. So they went near me and flirted with me. I was having NONE of it and since they were much bigger than me, I kicker one of em right in the balls. Yk when u kick it juuust right and cause the right amount of pain? Yeah, thats it. The others backer away and I noticed... A horny ah girl making out with her bf. I was shocked. So I screamed real loud, loud enough for her to run away. Boys washrooms are normally unbelievable loud. It was silent. People were just side eyeing each other. We left, no one snitched and we went on with our day. So this was my story about one of the most embarrassing moments in my life."]]