[["Reposts...", "r/Jokes has a search feature, input the title or punchline of your joke (before posting) and if it's been posted within the last month - please don't submit it."], ["Let's discuss spam, spammers, and the spamming spammers who spam.", "What did the moderator say to the subscribers?  Nobody knows, because nobody ever reads what moderators write.  ------  Yes, it was a bad joke, but at least it wasn't a repost... which is *kind of* what we're here to discuss today:  As many of you are no doubt aware, spammers and bad actors have been flooding Reddit lately, and /r/Jokes has started to get hit pretty hard. Dealing with the issue isn't as easy as it sounds, though, because any action that we take has the potential to affect good-faith users. Still, we've been discussing the problem, and we've come up with the beginnings of a solution:   We're going to ban every last one of our subscribers.  Just kidding! In fact, we're going to give you a bit more insight into how spammers work, what their goals are, and why they're so effective on Reddit. This information will be included on [our complete rules page](https://www.reddit.com/r/Jokes/wiki/index), which we've also streamlined and updated. (The rules themselves haven't changed; we've just made them a bit clearer and more condensed.) Our hope is that you'll be able to recognize and report spammers when you see them, which will help us keep them from gaining more of a foothold here.  We'll be taking some other anti-spam actions behind the scenes, so rest assured, we aren't trying to dump the spam-fighting on you. We just figured that it was better to keep everyone informed... because after all, /r/Jokes is a community, and a community is only as smart as its dumbest member.  (Yes, the moderators count as members, and yes, we're easily the dumbest.)  Thank you for reading, and remember to report spam when you see it!"], ["What’s the difference between a poorly dressed man on a tricycle and a well-dressed man on a bicycle?", "Attire"], ["A wife was cleaning their 12-year-old son’s bedroom. When she found a load of serious bondage gear and fetish mags, she asked her husband, “what do we do?”", "The husband said, “I’m no expert, but I wouldn’t fucking spank him.”"], ["One Easter Sunday, a man goes to church and returns home with two black eyes.", "His wife inquires as to how he got the black eyes.  The man goes on to say, “a lady stood up in front of me during mass, I saw her dress was stuck in the butt crack, so I reached out and tugged it out. She whirled around, became furious, and punched me in the eye.”  “That explains one black eye,” the wife says, “but what about the other?” The man explains, “I figured she must have liked her dress stuck up in her butt crack, so when she turned around I stuffed it back up there”"], ["I was stranded on an island with nothing but dark red grass, dark red sand, dark red trees everything was darkred.", "\"AHHH!\" i yelled \"I've been marooned!\""], ["I've finally finished chemo!", "Cancer can go suck my ball"], ["My Grandfather downed 35 German aircraft during WW2", "He still holds the record as the worst mechanic the Luftwaffe ever had."], ["A US Navy cruiser anchored in Mississippi for a week's shore leave.", "The first evening, the ship's Captain received the following note from the wife of a very wealthy and influential plantation owner: 'Dear Captain, Thursday will be my daughter's Debutante Ball. I would like you to send three well-mannered, handsome, unmarried officers in their formal dress uniforms to attend the dance. They should arrive promptly at 8:00 PM prepared for an evening of polite Southern conversation. They should be excellent dancers, as they will be the escorts of lovely refined young ladies. One last point: No Jews please.'  Sending a written message, the captain replied: 'Madam, thank you for your invitation. In order to present the widest possible knowledge base for polite conversation, I am sending three of my best and most prized officers.  One is a lieutenant commander, and a graduate of Annapolis with an additional Masters degree from MIT in fluid technologies and ship design. The second is a Lieutenant, one of our helicopter pilots, and a graduate of Northwestern university in Chicago, with a BS in Aeronautical Engineering. His Masters Degree and PhD. In Aeronautical and Mechanical Engineering are from Texas Tech University and he is also an astronaut candidate. Finally, the third officer, also a lieutenant commander, is our ship's doctor, with an undergraduate degree from the University of Georgia and his medical degree is from the University of North Carolina . We are very proud of him, as he is also a senior fellow in Trauma Surgery at Bethesda .'  Upon receiving this letter, the mother was quite excited and looked forward to Thursday with pleasure. Her daughter would be escorted by three handsome naval officers (and the other women in her social circle would be insanely jealous).  At precisely 8:00 PM on Thursday, Melinda's mother heard a polite rap at the door which she opened to find, in full dress uniform, three very handsome, smiling black officers.  Her mouth fell open, but pulling herself together, she stammered, 'There must be some mistake.' 'No, Madam,' said the first officer, 'Captain Goldberg never makes mistakes.'"], ["A new gym opened near me. They are currently going door to door signing up new members.", "It's called Jehovah's Fitness."], ["Why'd the pervert cross the road?", "Because his dick was stuck in the chicken."], ["Swearing Parrot", "A woman once visits a pet shop, to buy a parrot. She starts to check the parrots and notices one with a price tag 1/10th of the next cheapest. She asks about why this parrot is so cheap to the store owner, and he replies \"That parrot has the mouth of a sailor that's why he is so cheap\".   Lady thinks about it believes it couldn't be that bad since it is just a parrot and guesses he does not know many words, and buys the parrot for $50.  She takes the parrot to her house and as soon as they enter the room, parrot says \"Nice brothel, whore!\". She ignores this and gets ready to go on her date.  Once she gets back home with her date, the parrot says \"Welcome to the brothel whore, who is this bastard?\". Embarrased by the parrot to her date, she takes the parrot back to the pet shop and tells the store owner \"Make this parrot talk kindly and I'll give you $350 more.\". The store owner John accepts the deal.   Once she leaves, John takes the parrot to the back room, asks the parrot what he will say once she gets back home and parrot says \"I will say' Welcome to the brothel, whore!'\". John says no, you will say \"Welcome home madame\". John asks again and parrot still says \"I'll say welcome to the brothel whore\" and John tries to correct the parrot again. This goes on for a couple repeats with no sign of improvement on the language.   Tired of the repetitive words of the parrot, John brings a bucket full of water and asks the parrot one more time, parrot replies the same. So, John puts the parrots head in water for a while and pulls him back up and asks again. Parrot replies the same and John puts the parrots head underwater again. After a few cycles parrot says \"Ok, ok, I will say welcome to your home madame\".  After confirming the parrots response, John calls the lady to pick up the parrot. Lady arrives to the store and asks John whether she can test the parrot. Trusting his work, John agrees.   Lady asks the parrot \"What will you say when I get home?\", and the parrot says \"Welcome to your home madame.\". Lady asks \"What will you say when I get home with a man?\", parrot says \"Welcome home madame and monsieur.\". Lady trying the parrot asks \"What will you say when I get home with two men?\", the parrot says \"Welcome home madame, welcome home misters.\"   Still not convinced, she asks the parrot \"What will you say when I get home with 3 men?\"   The parrot stays silent for a moment and then screams, \"John! Get the fucking bucket, I swear to god this woman is a fucking whore!\"  -Translated from Turkish by me-"], ["Let me tell you my favorite knock knock joke!", "You start"], ["Two older guys were sitting on their usual park bench one morning. The 87-year-old had just finished his morning jog. The 80-year-old was amazed at his friend's stamina and asked him what he did to have so much energy.", "  The 87-year-old said, *\"Well, I eat rye bread every day. It keeps your energy level high and you'll have great stamina with the ladies.\"*  So, on the way home, the 80-year-old stops at the bakery. As he was looking around, the cashier asked if he needed any help. He said, *\"Do you have any Rye bread?\"*  She said, *\"Yes, there's a whole shelf of it. Would you like some?\"*  *\"I want 5 loaves.\"* he answered.  She said, *\"My goodness, 5 loaves! By the time you get to the third loaf, it'll be hard.\"*  Shocked, he replies *\"I can't believe it, everybody knows about this shit but me!\"*"], ["I tried joining a long-exposure photography course, but I didn’t learn anything.", "It all went by in a blur."]]