[["AITA Monthly Open Forum March 2023: Rule 11", "#Keep things civil. Rules still apply.   This month, we’re diving into all things rule 11. It’s one of our broadest rules, and often one of the most misunderstood.  Let’s start with the most common question - isn’t every post on this sub about some type of relationship? Yes, of course. One of the basic requirements of this sub is to post about interpersonal conflicts. And those typically don’t exist without some type of relationship (barring the random encounter with a stranger on the street, etc.).  What we look at is the nature of the relationship. When reviewing a post for rule 11, we ask ourselves if the conflict could exist outside the confines of a romantic relationship. Can this conflict exist between two friends, roommates, family members? If the answer is no, then it’s a rule 11 violation. A post about buying an engagement ring, considering a divorce/break-up, “catching feelings” for someone, romantic jealousy, dating, engaging in sexual acts, etc. are part of this rule. Choosing to not do any of the aforementioned also qualifies.   u/CutlassKitty gave a fantastic example in Januray’s Open Forum that sums this part of the rule up nicely:  > So \"AITA for telling my boyfriend to clean up after himself\" is allowed because it isn't about the relationship itself. But \"AITA for wanting affection from my partner\" isnt.  Borrowing from another user’s examples, u/stannenb gave this, also in January’s Open Forum: > I think pineapple on pizza is an abomination. I've told my spouse if they have to indulge in something demonic like that, do it outside the home. AITA? > I think pineapple on pizza is an abomination. I've told my spouse that if they indulge in something demonic like that, I'm going to leave them. AITA?  > The first conflict, about pineapple pizza within a relationship, is fine. > The second conflict is about ending the relationship because of pineapple pizza and would be removed.  However, rule 11 does not solely cover romantic relationships. It also covers cutting contact with/ghosting others. That includes family members and friends. Disclosing details of cheating also is covered and is often a reason for a post removal.   Reproductive autonomy decisions, such as having a child (or not), keeping the pregnancy (or not), and adoption also fall under rule 11. We have included situations about who to allow in a delivery room under this umbrella, as these conflicts regularly lead to breakups/divorce or involve threats for the same.   You might be asking “Why aren’t these topics allowed here?” There’s a couple answers to that question. One is that 99% of these questions are essentially about consent. We all recognize that anyone has the right to revoke consent at any time, whether that’s in direct relation to sex or just in terms of staying in contact with someone, or anything in between. This isn’t a matter that we can give moral judgement on; we simply cannot condone allowing a post where people tell someone they were wrong to exercise their right to consent. Another answer is that Reddit is a big place, and there are a ton of subs dedicated to relationships, etc. The answer there is simple - we have no interest in being another relationship sub. r/findareddit is a great resource if you’re not sure which sub is a good fit for your post.  ___  #As always, do not directly link to posts/comments or post uncensored screenshots here. Any comments with links will be removed.  ---  #[We're currently accepting new mod applications](https://forms.gle/M7i7hSF9iUUkHkqm9)  **We’re currently looking for mods with Typescript experience.**  We always need US overnight time mods. Currently, we could also benefit from mods active during peak \"bored at work\" hours, i.e. US morning to mid-afternoon.  * You need to be able to mostly mod from a PC. Mobile mood tools are improving and trickling in, but not quite there yet.  * You need to be at least 18.  * You have to be an active AITA participant with multiple comments in the past few months.  ---  We'd also like to highlight the regional spinoffs we have linked on the sidebar! If you have any suggestions or additions to this, please let us know in the comments."], ["AITA for not wanting to pay for my daughter's education only under certain conditions.", "I 52(M) have two kids, a son (26M) and a daughter (19F).  When my son went to college, I thought college would open up opportunities and he was supposed to major in computer science but failed a bunch of classes and changed his major to something less lucrative. He went out of state and I now realize that this was a poor investment.  I didn't want to make the same mistakes with my daughter. She also wants to do computer science and last year she got into a foreign university in the UK which she says is like Stanford over there (Cambridge).   I didn't want the same thing to happen so I told her I can't help her pay for that and to go to a local state university or community college than transfer. She ended up not going and deferred her admission to see if this year she can get a loan (which I'm not for, but it is her life) or if she can get a scholarship for a better American college.  She seems a little annoyed at me since effectively her brother got more money but that was before I knew better. I can afford the same for her but it would be tighter now and I don't want the same thing to happen especially if it would be for a foreign degree. I suspect the same could happen to her since her brother was typically the brighter one while she just pushed herself the last years of school.  AITA here?  EDIT: genuinely thanks for calling me out and making me do more research on Cambridge, I think I understand better now. I knew about it but maybe I underestimated it for being foreign. I'll definitely reconsider, she still has managed to defer her admission and I will see what I can do to help. The visa application needs proof of funds I think."], ["AITA for not buying a car for my stepdaughter?", "English is not my first language  I'm childfree. I like kids I just don't want to bring one into this world. I have a sister and a brother. My sister is also childfree but my brother has a 16yo daughter. We love our niece and we like to spoil her. For her 16th birthday we decided to buy a car for her which made her very happy.  I married my wife a year ago after dating for 13 years. She has a daughter and a son from her previous relationship. I like her kids and I think we generally get along. Her daughter turned 16 a week ago and I bought her a nice bag that she had said she wanted. I thought it's a good and thoughtful gift but my wife looked shocked. She didn't say anything in front of the guests but after the party was over she blew up at me and called me an asshole. She said they expected a car since I bought a car for my niece. We got into a fight and she is not talking to me now.  Edit: edited a typo. We dated for 13 years not 3 years"], ["AITA for locking my toiletries in a lockbox so my roommate doesn't use them?", "I (26F) have lived with my roommate (28F) for almost a year now. We were good friends before moving in together and have never had any serious issues up until this point.   For context: I have SUPER sensitive skin, always have. It would be easier for me to count the products I can use vs. the ones I can't. I have to use specific (and frankly expensive at times) products. If I use the wrong lotion/shampoo/laundry detergent etc. it causes my entire body to break out in itchy hives and welts. If I don't use my lotion my skin becomes painfully dry, itchy, and will crack to the point that it bleeds. My roommate knows about this and has seen the struggles that I have faced.  Anyways, for the last couple of months I've had a problem with her using my toiletries and I don't mean every once in a while. I mean daily. We have one bathroom in our apartment so we both have to use it. She uses my shampoo and conditioner every time she showers. She has been using my lotion every day. This is causing me to run out so fast and I'm struggling to afford to keep up with it. I've talked to her about it multiple times and have told her that I'm fine if she uses it occasionally, but that the rate she's using them now is not okay. I've even suggested that she buys her own if she likes it so much. But this has fallen on deaf ears, and I'm so tired. I moved all of my stuff out of the bathroom and put it in my room, and she still went in there to get it. (Our bedroom doors unfortunately do not have locks on them.) There have been so many times I've finished a shower, can't find my lotion, have to ask her where it is and she says it's in her room.   I finally got tired enough to buy a lockbox and keep my toiletries in it. This, however, caused her to become very mad at me. She threw it in my face that she lets me use her hair styling tools (blow dryer, straightener, curling iron etc.) and I kept trying to tell her that it's just not the same. I would let her use anything else of mine if she wanted to, and I do. I frequently let her borrow my clothes, have some of my food, etc. We split rent and bills 50/50 and there have been a few times I've had to cover parts for her (Not frequently). Now her and a couple of our mutual friends are saying that I'm an asshole because I'm treating her like some sort of thief when she never had bad intentions. That I'm being selfish and materialistic too. AITA??"], ["AITA for announcing my pregnancy immediately after my sister?", "My husband and I have been trying for our second baby for two and a half years. We lost 2 pregnancies during that time, though we only told our families about the first. I’m incredibly grateful to now be 13 weeks pregnant and have been looking forward to sharing that news with my family.   On Friday, we had dinner with my family - my sister, her boyfriend, and our parents - and we decided to share our news then. I decided to wait until dessert, so that we could leave shortly after telling everyone. Obviously, it’s exciting news, but I was worried about all the emotions that could surface for myself and my husband.  Right after we sat down to eat, my sister announced that she and her boyfriend are expecting their first child. I was thrilled for her and congratulated her, as did the rest of the family. Once things had settled down, I didn’t want to waste the opportunity to have everyone together and thought it would be a good opportunity to keep the joy flowing, so I shared that I’m pregnant as well.  Our parents were so excited to be having two new grandbabies just a month apart and I was super happy that my kids would have a new cousin. My sister was happy for me but she left very soon after dinner and didn’t stay for dessert.  She called me this afternoon and told me that as happy as she was for me, she felt that I’d done a shitty thing by taking away “her moment.” She pointed out that this is my second baby and when I announced for the first time, I didn’t have to “share” with anyone. I didn’t want to apologize because I didn’t feel I’d done anything wrong, but she finished out the phone call by saying that she didn’t think I was really even happy for her, if I couldn’t have let her have that moment and taken another for myself later on. That really stung.  I truly didn’t see it that way. I saw it as sharing joy, not stealing it. I also see each pregnancy as being unique, so I don’t feel that it was right of her to say I shouldn’t have said anything because it was my second baby. Honestly, I think she might be kind of hormonal. But I also want to understand my sister and I know I’m not going to get anywhere asking her about it. So, I want to be enlightened. AITA for announcing my pregnancy immediately after my sister?  ETA: I’m visiting from Los Angeles, my sister lives in New Jersey and our parents live in NYC."]]