[["TIFU by being tricked by a straight guy into dating him", "So to start things off. I’m gay, I live in a small town in the middle of nowhere USA. I’m a Male 18.  I wasn’t ever really bullied for being gay. Unless it was online everyone was cool with it except the super conservative families in town. Of course I’ve heard my fair share of names and threats but I shrug them off. It’s normal to me.   There’s this group of boys, who are like the super bro dude straight guy group of the school. They act more gay than I do but still call me names etc. In this group there’s this guy I’ll call Skyler.  Skyler is my age, looks like a puppy dog,  and was very sweet to me always, but always presented as straight. Which is why I was shocked when he asked me out this summer. I mean. I’m not ugly or anything. I just didn’t expect this super dude bro jock to ask me out.   Our first date was amazing. I mean, it was on the Fourth of July at our state fair. We got corn dogs played games and he kissed me on the Ferris wheel.   After a few dates we had gotten a lot closer. (We never had sex though, he wanted to wait and I respected that) my ex boyfriends birthday was on October 20th.   He had this huge party and invited everyone and of course I wasn’t shocked when he invited me. This is where I was stupid, I was head over heels for this guy. I was like stupid in love with him. I mean I’d get giddy every single time I saw him and I’d get butterflies in my chest whenever he touched me even after three months. I was in love with him. I think part of me still is which is why I’m heartbroken writing this.   I bought my boyfriend skyler this beautiful pendant and chain. It was a 18 karot gold with a diamond. (Very expensive, cost me two years of working part time at McDonald’s) I was very excited to give this to him.   At his party he brushed me off the entire time. I gave him his gift and a letter that I wrote from the bottom of my heart. I thought we were forever.   Turns out it was all a lie. He started getting giggly with his friends reading the letter and when he finished he was crying laughing.   That’s when he started explaining that it was all a dare and that he only went out with the town “f slur” to win a bet. He thanked me for the necklace and went on with his party.  I’ve stayed home for several days now. Im heartbroken and just devastated. I thought this boy was the absolute love of my life. Turns out all of his friends was in on everything. To the text messages and the letters we would write each other.   We were on the down low because he said he wasn’t ready to tell his family he was bisexual. This was already a red flag I ignored because his mom is bisexual, and would’ve been completely fine with it. But this entire time he tricked me. He broke my heart into pieces and I can’t help but scream into my pillow. I want to hurt him the way I hurt. I want to hear him scream the gut wrenching screams I scream late at night when the earth is quiet into my pillow so my family can’t hear me.   I can’t go back to school, I am already the laughing stock on social media. I’m thinking of switching schools and going to live with my aunt. I was blinded by love and hurt.   TLDR: ignored red flags of guy who asked me out, dated for three months, buy him expensive necklace, he says it was a dare"]]