[["TIFU by giving up my dream since I was a child for my curriculum.", "&#x200B;\n\nFor as long as I can remember, I've been dreaming of going to Spain as an exchange student.\n\nA couple of years ago, I became fascinated with Spain thanks to its culture and the online friends I made. Going as an exchange student would help me get into a good college.\n\nI'm now in 11th grade, and I finally managed to get a spot in an exchange student programme directed to students interested in studying in Spain for a semester.\n\nI was able to convince my parents about it and we started the payments this month.\n\nThe thing is that I am on the robotics team, which attends regional and world FIRST tournaments. I am in the programming area, and this year I decided to apply as a driver in this off-season. I didn't think I would get in, but in the end I did, and I participated in a competition in which my coaches saw that I had very good potential and talent in the area.\n\nOn the third day of the off-season tournament, my general coach pulled me aside and asked me if I could cancel my exchange programme and stay for the new season to participate in the world tournament. I refused since that programme has been a dream for me. However, he told me about the possibility of getting a scholarship at my dream college just by having my participation in a FIRST competition on my resume, plus that would make me the first female driver on the team.\n\nHe managed to convince me, and I started the process of getting my money back and cancelling the programme.\n\nI had never regretted my decision until today... which was my deadline to cancel my exchange programme.\n\n57 minutes ago, I entered the page and, right before I could click cancel, I broke down in tears.\n\nThere was no turning back\n\nI've been sobbing for the last hour non-stop.\n\nHave I done the right thing?\n\nI regret my decision, but part of me knows that I would have regretted it just as much if my decision had been the other way around.\n\n&#x200B;\n\n//Hey ppl This is an eddit:  \ni forgot to mention that my school requires students to participate in an exchange program to be able to graduate :c\n\nI'm already trying to convince my school principal to open a programme for fall 2023 (which would be my last chance to go since January-July I have FIRST competitions).\n\nTL;DR:\n\nI've been dreaming of going as an exchange student to Spain. I was accepted into a programme, but my robotics coach persuaded me to stay because he believes I have the potential to compete in a world tournament. TIFU by giving up my exchange student dream for a spot in a robotics team"]]