[["TIFU by hiding my friend's story from my boyfriend", "I 22f have been dating my boyfriend 24m for 3 years and a half now. Even though our relationship has it's up and very usual downs, i've always loved him and have never cheated on him. My boyfriend has this habit of not trusting me and accusing me of hiding things from him even though i always make sure to tell him every single detail about every encounter/ friendship/ conversation i have, because i know what it feels like to be insecure and i would never wanna give him a reason to think i'm being dishonest with him. However, he never liked my girl friends nor my boy friends because he thinks the first are hoes ( they are all single and just kind of living life which even if they are hoes i don't know how would that impact who i am) and because he thinks that the seconds would \"hit\" if they ever get the chance to. Now to the issue, one day, my boyfriend and i got into a fight because i wanted to go clubbing with my friends and didn't invite him. My reasoning is that, he doesn't like them and he only talks shit about them so why would you wanna take someone out with someone they have already said they didn't like. He on the other hand was pissed off because he thought that i was trying to do something behind his back. Our argument escalated and it end up in a big fight. This took place on friday night (the club was not till saturday). After the fight i left to have a coffee with my friends, when one of my girlfriends ( that he follows) took an instagram story of all of us just chatting and posted it. Nothing wrong with that right? Well my boyfriend has this habit of misunderstanding things and taking them out of their context. I was afraid that he would think that i went out even when we were fighting to piss him off. I was afraid that he would block me and stop talking to me (which he does a lot). So this is where i might've fucked up, i asked my friend to hide her story from my boyfriend for the night. I know that wasn't my smartest move. He one day found out what i did via a voice message i sent to her talking about how he didn't find out about that night and that she  forgot to remove the hide. He got so pissed and thought that i'm hiding something major from him even to i offered to call my friend so she can show him the archive of the stories on that night or any other night. He broke things off with me and he wouldn't talk to me. So? did i fuck up?\nTL;DR: i fucked up by hiding my friend's story from my boyfriend which made him suspicious that i'm lying and hiding other stuff from him.\n\n\nEDIT: I think i should mention this, he found the conversation after going through my instagram behind my back when i'm at work. I talk freely with my girlfriends on instagram because i would've never thought that he would want to read the conversations. Also this is the first time that he does this, except when he asks to read a conversation with a guy and i always hand him the phone because i have nothing else to hide.\n\nadditional info: this is not the first time that he gaslights me or leaves without letting me even explain myself, i tried to explain where i'm coming from and give him any messages he wants to read or show him what my friend has been posting for the past couple of weeks, he didn't listen. He always does this. He bomb loves me, then when the smallest argument happens, he lashes out, calls me the ugliest names and leaves. He then blocks me on everything, until i go look for him and beg him to talk to me several times. I know this relationship is toxic but the times when it's good it's REALLY good, it makes me never wanna leave."]]