[["I’m a woman and a feminist but I have a kink for misogyny", "This is very confusing to me and I wish I didn’t have it but it’s not going away. Politically, I am a huge feminist, like the type that reads feminist literature and political theory and I hate how deep rooted misogyny is within our culture. HOWEVER in bed my stupid brain somehow seems to get off on men that hate women, and what’s worse is that it doesn’t draw the line at role play I am genuinely attracted to actual sexists. I don’t know why I enjoy this and it goes against all of my morals but I can’t seem to get rid of it."], ["to those who have lost your virginity, please help me out. i am wildly insecure about one little embarrassing thing.", "im a teenager, afab, and i plan on losing my virginity in a week. my boyfriend and i love each other very much and have obviously talked about this subject a lot. i act confident and freaky with him over text and when we talk, but i am so scared for when we actually follow through. im a confident person, i know how conventionally pretty i am, but i'm so insecure about what's in between my legs. it doesn't look like what other girls have, my labias are a bit big and i don't want my boyfriend to see it and be grossed out. he is not a virgin and was sexually active with his previous partners, and if what i have isn’t common then i’m sure he’ll be shocked when he sees it.  do guys care? if you have this, please let me know and give me some reassurance. when love and lust combine, do things like this actually matter?   i will update as soon as i can  edit #1: everything i’m receiving is making me feel better and better, i’m so so glad i’m not alone and people like me have good experiences. please keep giving me your experience and such, i really needed this"], ["I think I like girls", "Soo I have always identified as straight and I love men soo much. You guys are all so pretty. But I have had some crushes on girls in the past. The thing is they were always a little masculine so I thought my brain just got confused. Now I met this girl (very feminine), shes so beautiful and everytime she looks at me with that pretty smile I melt a little.   Thats it I just wanted to share how i feel <3"], ["Big Boobs", "I have big boobs and I feel awkward hugging people because I KNOW they feel my boobs. But, at the same time I love hugging guys specially the ones that I'm never going to have. Like the crush I had and turned me down. Makes me feel powerful because everyone likes boobs and I know what I've got. That's it. That's my confession. I enjoy the feeling. I enjoy to know that guys are hugging me and feeling my big breasts against them."], ["I want to fuck my neighbour’s wife…", "I (24m) hear my (35F) neighbour have sex with her husband have sex nearly every two days. She moans for about a minute or two and then goes quiet. After I came home one night I heard her segueing with her husband because she has been cheating on him due to the poor sex. I have had a crush on her since I moved in, every night now I hear her having sex with different men. I wish it was me."]]