[["TIFU by putting my sex toys in a bad hiding spot", "Hi so I (19) live at home with my mother, father and brother (29) (not putting my parents ages because I don't think it's that relevant). I'm taking a gap year and have a girlfriend (22F) who visits my house pretty often. \n\nI've gotten some sex toys from her as well as from target when we went there on a shopping date and my dumb ass thought it would be a great hiding spot to put them all in a swimwear bag in my drawer. \n\nNow I'm aware that my mom likes to snoop but I never thought she would ACTUALLY OPEN IT to find out about the contents, and this all happened when I was on a tour in Europe with my schoolmates. Me and my friends went to a sex shop there and bought toys back to America and I added that to my swimgear bag.\n\nAfter I got back from Europe and settled in back at home, my mom came into my room, opened my draw and pulled out the bag and sat down on my bed next to me to have a talk with me.\n\nLet me tell you my face was so hot from embarrassment I could fry an egg. She told me about how \"you're old enough and I respect your privacy but you know don't do it too much its bad for your health!\" and has left me mortified. In my swimgear bag, I also have my actual swimgear in it and my mom asked me where it was so she could wash it along with the rest of the laundry and I just stared at her shaking my head after the conversation and she was like oh.\n\nThis also isn't the first time that's happened. She found the one I bought in Europe and told me not to buy anymore because its unnecessary and I just tried to move the conversation forward as quickly as possible. \n\nNow when I say this isn't the first time, I mean that my parents have probably accidentally heard me and my girlfriend being \"too loud\" in the middle of the night which I feel so bad for them hearing. She had a talk with me about that too and basically repeated the same thing about the sex toys. So now its something I think about from time to time and remember the embarrassment.\n\ntldr: i hid my sex toys in a bad spot and my mom had to have a talk with me after discovering them"], ["TIFU by not knowing what a gallbladder attack was and thinking it was back pain for 10 years, and my not managing my care better.", "EDIT: Today I apparently also fucked up the title. Sorry.\n\nA number of years ago, I was at a red light and a woman texting and driving broke by neck and back in four places when she rear ended me. I'm only alive because I was in my SUV and not on the Harley. (I also can't ride anymore as a result, but whatever.)\n\nSince then, I've had horrible back pain. It comes and goes, and is managed with regular massage, a TENS unit and some medication. Sometimes the pain would hit me right in my lower to mid back, but it felt deeper than that. I'd be unable to sit, stand or lie down - everything hurt. I'd be reduced to tears most of the time. I had one at work and had to be taken home in a wheelchair to the car and a co-worker drove me home. This happened 3-6 times a year, sometimes in the morning, sometimes at night. \n\nI'm not sure I can describe how bad these attacks were - it felt like someone beat my lower to mid back with a baseball bat. They were literally debilitating and I would often fall asleep sobbing from the pain. Even the heavy duty opiods the VA had me on like Morphine barely touched the pain.\n\nAlong with all that, the 13 different drugs the VA used to have me on really messed up my stomach, and I had a bunch of issues with loose stool alternating with constipation and cramps. I always had diarrhea around these attacks but never put two and two together, because I didn't really understand what a gallbladder does. That was the first part of my fuck up - not knowing that.\n\nIf you don't know, it stores bile so you can digest fat. Without it, the fat just goes right through you, giving you loose stool or worse. Just like in your kidney, you can get gallstones. Those stones can block the duct, causing a buildup of bile. This entire time, I was experiencing a gallbladder attack, where it was having trouble doing its job because of the gallstones, so it was becoming severely inflammed, triggering the back pain. \n\nWhy wasn't this discovered sooner? My GP at the VA was treating my pain, and the specialist was treating my stomach issues. Guess who didn't talk to each other often enough? The revolving door of doctors at the VA kept me from having docs who talk to each other. That was the second part of my fuck up - I should have been on the different newly hired GP who I saw twice a year to read back through my notes and get caught up. Instead it was take vitals, renew meds, referral to specialist, out the door until six months later to meet a new GP when I came back for my bi-annual check up.\n\nThey removed the galbladder several years ago. When I woke up in recovery and the doc came to check on me, he told me that mine was the worst gallbladder he had seen in years. He described it as \"riddled\" with gallstones and said he was amazed I wasn't having more attacks.\n\nI can't even tell you what a relief it is to not have the attacks anymore. It was well worth the change in diet and having to give up some foods. It also causes you to need the bathroom more than before but again, to hell with back pain.\n\nTL;DR: Thought my back pain was just back pain - it was gallbladder attacks caused by fatty foods and I didn't put two and two together or manage my revolving door of doctors correctly to diagnose this."], ["TIFU by accidentally teaching my roommate's parrot to sing CBAT. My roommate doesn't know yet.", "**Bird audio hyperlinked at the very end**\n\nI am so dead. My roommate is out of town camping until the end of the weekend and he's going to kill me when he finds out.\n\nOk, so we all know the story with [CBAT](https://www.reddit.com/r/tifu/comments/x35iu6/tifu_my_20f_girlfriend_of_two_years_told_me_the/), no need to go into that. My roommate is out of town for a week, and I have the whole apartment to myself. Four days ago, I (29m) asked my gf (29f) if she would like to enjoy some delicious fun time while blasting CBAT. Her and I are both super weird, and are open to doing this kind of dumb stuff. To no surprise, she laughed and said yes. I just thought it would be funny to experience. To my surprise, it really wasn't as weird as I thought it would be. It might be that the love I have for her is so powerful, that it left only about 5% of my brain power focusing on the dolphin sounds in the background.\n\nThe next day we decided to go at it again, only this time CBAT was a surprise for her. After a few minutes of kissing, I turned on the music and we both started laughing hysterically before getting it on. I even lasted longer than the day before, which I now regret.\n\nHere's the problem which I stupidly did not even take a second to consider. While my roommate is out of town, I'm taking care of his parrot who dwells in our living room, which shares a very thin door with my bedroom. This is no ordinary parrot. This is a chattering lory (same bird as that red one on youtube who goes \"wuewuewue\"). This bird does not shut up. He makes so much noise that I've naturally learned to ignore him after a year of living with it.\n\nAnyway, somehow it never even crossed my mind that these parrots learn words and sounds and mimic them surprisingly accurately. Before leaving for work yesterday morning, I made some coffee and sat down in the living room for a bit just relaxing and closing my eyes. All of a sudden, I hear the first few notes of CBAT in perfect pitch and rhythm. I opened my eyes and this little dude is staring me dead in the face. 5-10 seconds pass, and I hear it again. I just grabbed my things and left for work immediately. I had to escape, figuring I'd just find a way to fix this or explain this later. But the more I think about it, the more I realize that I'm just dead. My roommate isn't weird like me and he hates when I say silly things to the bird. When he comes back this weekend, I'm worried he's gonna give a notice and leave.\n\nAny advice on how to go about this would be greatly appreciated. I'm sweating as I'm writing this.\n\nAnd no, for privacy reasons, I will not be posting a video of the bird.\n\nTL;DR I tried intercourse with my gf twice while blasting CBAT just for the experience, and my roommate's parrot learned the song. My roommate doesn't know about this yet.\n\nEDIT: When I get back home from work today, I will sit by the bird and record audio.\n\nEDIT 2: Hyperlinked CBAT above for those who haven't read the story.\n\nEDIT 3: [Here’s the audio you skeptics](https://voca.ro/16NdnZIFs0d4). Enjoy CBIRD. God help me."]]